Repository: skoruba/IdentityServer4.Admin
Catalog: src/Skoruba.IdentityServer4.Admin.UI/Resources/Areas/AdminUI/Views/Configuration/Client/Section/Label.*.resx
Languages: ar, es, fr, nl, pt, ru, sv

# AbsoluteRefreshTokenLifetime_Info
source: Maximum lifetime of a refresh token in seconds. Defaults to 2592000 seconds / 30 days
ar: اقصى مدة للرفرش توكن بالثواني. الافتراضي هو 2592000 ثانية / 30 يوم
es: El tiempo de vida máximo de una token de refresco en segundos. 2592000 segundos / 30 dias por defecto.
fr: Durée de vie maximale d'un refresh token en secondes. Valeur par défaut : 2592000 secondes / 30 jours
nl: Maximale levensduur van een refresh token in seconden. Default is 2592000 seconden / 30 dagen
pt: Duração máxima de atualização de token em segundos. O padrão é 2592000 segundos/ 30 dias
ru: Максимальный срок действия обновления токена в секундах. По умолчанию до 2592000 секунд / 30 дней
sv: Maximal livstid av en uppdateringstoken i sekunder. Standard är 2592000 sekunder / 30 dagar

# AbsoluteRefreshTokenLifetime_Label
source: Absolute Refresh Token Lifetime
ar: مدة absolute referesh token.
es: Tiempo de vida absoluto de la token de refresco
fr: Durée de vie d'un refresh token (Absolute)
nl: Absolute Refresh Token levensduur
pt: Duração absoluta de atualização do token
ru: Абсолютное обновление Срока Действия Токена
sv: Livstid på absolut uppdateringstoken

# AccessTokenLifetime_Info
source: Lifetime of access token in seconds (defaults to 3600 seconds / 1 hour)
ar: مدة access token بالثواني ( الافتراضي هو 3600 ثانية/ 1 ساعة)
es: El tiempo de vida de la token de acceso en segundos. 3600 segundos / 1 hora por defecto.
fr: Durée de vie du jeton d'accès en secondes (par défaut 3600 secondes / 1 heure)
nl: Levensduur van een access token in seconden (default is 3600 seconden / 1 uur)
pt: Duração de acesso do token em segundos (o padrão é 3600 segundos/ 1 hora)
ru: Срок действия токена доступа в секундах (по умолчанию 3600 секунд / 1 час)
sv: Livstid av en åtkomsttoken i sekunder (standard är 3600 sekunder / 1 timme)

# AccessTokenLifetime_Label
source: Access Token Lifetime
ar: مدة الـ access token
es: Tiempo de vida de la token de acceso
fr: Durée de vie des jetons d'accès
nl: Access Token levensduur
pt: Duração de acesso do token
ru: Срок действия токена доступа
sv: Livstid på åkomsttoken

# AccessTokenTypes_Info
source: Specifies whether the access token is a reference token or a self contained JWT token (defaults to Jwt).
ar: يحدد اذا كانت الـ access token هي reference token او انها محتواة ذاتيا JWT token (الافتراضي هو jwt).
es: Especifica si la token de acceso es una token de referencia o una token JWT autocontenida. JWT por defecto.
fr: Indique si le jeton d'accès est un reference token ou un jeton JWT (par défaut : JWT).
nl: Geeft aan of het access token een reference token betreft of een self-contained JWT token (default is JWT)
pt: Especifica se o acesso do token é referência do token ou um token JWT independente (o padrão é JWT).
ru: Указывает, является ли токен доступа ссылочным токеном или cамостоятельным JWT токеном (по умолчанию до Jwt).
sv: Specificerar om åtkomsttoken är en referenstoken eller en självständig JWT token (standardvärde är JWT).

# AccessTokenTypes_Label
source: Access Token Type
ar: نوع Access Token
es: Tipo de token de acceso
fr: Type de jeton d'accès
pt: Tipo de acesso do token
ru: Тип токена доступа
sv: Typ av åtkomsttoken

# AllowAccessTokensViaBrowser_Info
source: Specifies whether this client is allowed to receive access tokens via the browser. This is useful to harden flows that allow multiple response types (e.g. by disallowing a hybrid flow client that is supposed to use code id_token to add the token response type and thus leaking the token to the browser.
ar: يحدد اذا كان العميل يسمح باستقبال access token بواسطة المتصفح. هذا مفيد للسريان الصعب التي يسمح بانوع استجابات متعددة مثلا ( بمنع hyprid flow العميل من المفترض ان يستخدم code و id_token لاضافتهم الى نوع استجابة الـ token وبهذا سيتسرب الـ token الى المتصفح.
es: Especifica si este cliente le es permitido recivir tokens de acceso via navegador. Esto es util para reforzar flujos que permite multiple tipos de respuesta (Por ejemplo, impidiendo a un cliente de flujo hibrido que se supone que usa el código id_token para agregar el tipo de respuesta de token y por ende dejando escapar la token al navegador).
fr: Indique si ce client est autorisé à recevoir des jetons d'accès via le navigateur. Ce qui est utile pour sécuriser les flows qui permettent des types de réponse multiples (par exemple en refusant un client de flow hybride qui est censé utiliser le code id_token avec le type de réponse du jeton, exposant ainsi le jeton dans le navigateur.
nl: Geeft aan of deze client access tokens mag ontvangen via de browser. Dit is nuttig om flows met ondersteuning voor meerdere response types robuster te maken (bijvoorbeeld in geval van een hybrid flow client, welke geacht wordt om een code id_token te gebruiken, te verbieden om het token response type toe te voegen wat zou leiden tot het prijsgeven van dit token via de browser).
pt: Especifica se este sistema tem permissão para receber acesso do token por meio do navegador. Isso é útil para proteger fluxos que permitem vários tipos de resposta (por exemplo, desaprovando um sistema de fluxo híbrido que deveria usar o código ID_token para adicionar o tipo de resposta do token e desta forma levando o token para o navegador.
ru: Указывает, разрешено ли клиенту получать токен доступа через браузер. Целесообразно для затруднения потоков допускающих множество типов ответов (например путем отказа клиента гибридного потока, который должен испольозвать код id_token для добавления типа ответа токена и таким образом происходит утечка токена в бразуер.
sv: Specificerar om denna klienten tillåts att motta en åtkomsttoken via en webbläsare. Detta är användbart för att göra det svårare för flöden som tillåter flera typer av svar (som t.ex. att inte godkänna en hybridflödes klient som vanligtvis skall använda "code id_token" att använda en "response token" och där med läcka token till webbläsaren)

# AllowAccessTokensViaBrowser_Label
source: Allow Access Token Via Browser
ar: السماح للـ Access Token بواسطة المتصفح
es: Permitir token de acceso via navegador
fr: Autoriser le jeton d'accès via le navigateur
nl: Access Token via browser toegestaan
pt: Permitir acesso do token por meio do navegador
ru: Разрешить Токен Доступа через Браузер
sv: Tillåt åtkomsttoken via webbläsare

# AllowOfflineAccess_Info
source: Specifies whether this client can request refresh tokens (be requesting the offline_access scope)
ar: يحدد فيما اذا كان هذا العميل يطلب refresh token (كونه يطلب مدى offline_access).
es: Especifica si este cliente puede solicitar tokens de refresco (solicitando el alcance offline_access).
fr: Indique si ce client peut demander des refresh tokens (nécessitera le scope offline_access)
nl: Geeft aan of deze client refresh tokens mag opvragen (m.a.w. dit betreft een offline_access scope request)
pt: Especifica se este sistema pode solicitar atualização dos tokens (solicitando o escopo offline_access)
ru: Указывает, может ли этот клиент запрашивать обновление токенов (запрашивать область автономного_доступа (offline_access))
sv: Specificerar om en klient kan begära uppdateringnycklar (genom att fråga efter offline_access begränsningen)

# AllowOfflineAccess_Label
source: Allow Offline Access
ar: السماح للـ Offline Access
es: Permitir acceso sin conexión
fr: Autoriser l'accès hors ligne
nl: Sta Offline Access toe
pt: Permitir acesso offline
ru: Разрешить автономный доступ
sv: Tillåt offlineaccess

# AllowPlainTextPkce_Info
source: Specifies whether clients using PKCE can use a plain text code challenge (not recommended - and default to false)
ar: يحدد فيما اذا كان العميل يستخدم PKCE ويستخدم بنصوص واضحة (لا ينصح بها - الافتراضي هو خطأ)
es: Especifica si los clientes usando PKCE pueden usar el desafio de código de texto plano. No recomendado. Deshabilitado por defecto
fr: Indique si les clients utilisant PKCE peuvent utiliser un code challenge en texte clair (non recommandé - et par défaut à Faux)
nl: Geeft aan of PKCE clients een plain text code challenge mogen gebruiken (afgeraden - default is false).
pt: Especifica se os sistemas que usam PKCE podem usar um desafio de código de texto sem formatação (não recomendado - e o padrão é falso)
ru: Указывает, могут ли клиенты PKCE использовать вызов обычного текстового кода (не рекомендуется - по умолчанию значение равно false)
sv: Specificerar om en klient som använder PKCE kan använda text kod anrop (inte rekommenderat - standardvärde, avaktiverad)

# AllowPlainTextPkce_Label
source: Allow Plain Text Pkce
ar: السماح بالنصوص الواضحة
es: Permitir PKCE en texto plano
fr: Autoriser le texte en clair Pkce
nl: Sta Plain Text PKCE toe
pt: Permitir texto PKCE sem formatação
ru: Позволить обычный текстовый код Pkce
sv: Tillåt PKCE via vanlig text

# AllowRememberConsent_Info
source: Specifies whether user can choose to store consent decisions. Defaults to true.
ar: يحدد فيما اذا كان المستخدم بامكانه اختيار قرار حفظ الموافقة. الافتراضي هو صحيح
es: Especifica si el usuario puede escojer almacenar las deciciones de consentimiento. Habilitado por defecto.
fr: Indique si l'utilisateur peut choisir d'enregistrer les décisions de consentement. La valeur par défaut est Vrai.
nl: Geeft aan of de user mag kiezen om de consent-keuze op te slaan. Default is true.
pt: Especifica se o usuário pode optar por armazenar decisões de consentimento. O padrão é verdadeiro
ru: Указывает,может ли пользователь сохранять решения о подтверждении. По умолчанию значение равно true.
sv: Specificerar om en användare kan välja att spara medgivanden. Standardvärde, aktiverad.

# AllowRememberConsent_Label
source: Allow Remember Consent
ar: السماح بتذكر الموافقة ، الافتراضي هو نعم
es: Permitir recordar censentimiento
fr: Autoriser l'enregistrement du consentement
nl: Sta onthouden Consent Keuze toe
pt: Permitir lembrar consentimento
ru: Разрешить Запоминать Подтверждения
sv: Tillåt spara medgivanden

# AlwaysIncludeUserClaimsInIdToken_Label
source: Always Include User Claims In IdToken
ar: دائما ضمن مطلبات المستخدم في id_token
es: Siempre incluye reclamaciones de usuario en IdToken
fr: Toujours inclure les User Claims dans IdToken
nl: Neem User Claims altijd op in het IdToken
pt: Sempre incluir permissões de usuário no Idtoken
ru: Всегда включайте Утверждения Токена в идентификатор токена (IdToken)
sv: Inkludera alltid användaranspråk i IdToken

# AlwaysSendClientClaims_Info
source: If set, the client claims will be sent for every flow. If not, only for client credentials flow (default is false)
ar: اذا تم اختياره ،مطالبات العميل سيتم ارسالها لكل سريان وبعكس ذلك سيتم ذلك فقط في حالة credentials flow (الافتراضي هو خطأ)
es: Si esta establecido, las reclamaciones de cliente seran enviadas en cada flujo. En caso contrario, solo para el flujo de credenciales de cliente. Deshabilitado por defecto.
fr: Si activé, les User Claims seront envoyées à chaque flow. Sinon, uniquement pour le credentials flow du client (Faux par défaut)
nl: Wanner dit is gespecificeerd zullen client claims altijd worden verzonden voor elke flow. Wanneer dit niet gespecificeerd is, worden client claims alleen in geval van de client credentials flow verzonden.
pt: Se definido, as permissões do sistema serão enviadas para cada sistema. Se não definido, será enviado apenas para o fluxo de credenciais do sistema (o padrão é falso)
ru: Если задано, утверждения клиента будут отправляться для каждого потока. Если нет, только для потока учетных данных клиента (по умолчанию значение равно false)
sv: Klientanspråk skickas med varje flöde om denna är aktiverad. Om inte så skickas det med för referens flödet. Standardvärde, avaktiverad.

# AlwaysSendClientClaims_Label
source: Always Send Client Claims
ar: دائما ارسل مطالبات المستخدم
es: Siempre enviar reclamaciones de cliente
fr: Toujours envoyer les User Claims
nl: Client Claims altijd versturen
pt: Sempre enviar permissões do sistemas
ru: Всегда Отправляйте Утверждения Клиента
sv: Skicka alltid med klientanspråk

# AuthorizationCodeLifetime_Info
source: Lifetime of authorization code in seconds (defaults to 300 seconds / 5 minutes)
ar: عمر رموز المصادقة بالثواني (الافتراضي هو 300 ثانية / 5 دقائق)
es: El tiempo de vida del codigo de autorización en segundos. 300 segundos / 5 minutos por defecto.
fr: Durée de vie du code d'autorisation en secondes (par défaut 300 secondes / 5 minutes)
nl: Geldigheid van authorization code in seconden (default is 300 seconden / 5 minuten)
pt: Duração do código de autorização em segundos (o padrão é 300 segundos / 5 minutos)
ru: Срок действия кода авторизации в секундах (по умолчанию 300 секунд / 5 минут)
sv: Livstid för åtkomstkod i sekunder (standardvärde 300 sekunder / 5 minuter)

# AuthorizationCodeLifetime_Label
source: Authorization Code Lifetime
ar: عمر رمز المصادقة
es: Tiempo de vida del código de autorización
fr: Durée de vie du code d'autorisation
nl: Geldigheid Authorization Code
pt: Duração do código de autorização
ru: Срок действия кода авторизации
sv: Livstid på åtkomstkod

# ClientId_Info
source: Unique ID of the client
ar: معرف فريد للعميل
es: ID unica del cliente
fr: ID unique du client
nl: Unieke ID van de client
pt: ID exclusivo do sistema
ru: Уникальный ID клиента
sv: Klientend unika id

# ClientId_Label
source: ClientId
ar: معرف العميل
es: ID del cliente
pt: ID do sistema
ru: ID Клиента
sv: KlientId

# ClientName_Info
source: Client display name (used for logging and consent screen)
ar: اسم العميل (لغرض العرض)
es: Nombre en pantalla del cliente. Usado en las pantallas de inicio de sesión y consentieminto.
fr: Nom d'affichage du client (utilisé pour l'enregistrement et l'écran de consentement)
nl: Waargavenaam voor de client (gebruikt voor loggingdoeleinden en weegave op het consent scherm).
pt: Mostrar nome do sistema (usado para log e tela de consentimento )
ru: Отображаемое имя клиента (используемое для входа и экрана подтверждения)
sv: Klient visnings namn (används vid inloggnings- och medgivandesidorna)

# ClientName_Label
source: Client Name
ar: اسم العميل
es: Nombre del cliente
fr: Nom du client
nl: Client naam
pt: Nome do sistema
ru: Имя Клиента
sv: Klientnamn

# ClientUri_Info
source: URI to further information about client (used on consent screen)
ar: رابط لمعومات اكثر حول العميل ( تستخدم في شاشة الموافقة)
es: URI hacia más información acerca del cliente. Usado en la pantalla de consentimiento.
fr: URI pour d'autres renseignement sur le client (utilisés sur l'écran de consentement)
nl: URI naar meer informatie over de client (gebruikt op het consent scherm)
pt: URI para obter informação sobre o sistema (usado na tela de consentimento)
ru: URI для дальнейшей информации о клиенте (используемый на экране подтверждения)
sv: Uri för detaljerad information om en klient (används på medgivandesidan)

# ClientUri_Label
source: Client Uri
ar: رابط العميل
es: URI del cliente
pt: URI do sistema
ru: URI Клиента
sv: Klienturi

# Enabled_Info
source: Specifies if client is enabled. Defaults to true.
ar: يحدد فيما اذا كان العميل مفعل الافتراضي هو نعم.
es: Especifica si el cliente esta habilitado. Habilitado por defecto.
fr: Indique si le client est activé. La valeur par défaut est Vrai.
nl: Geeft aan of de client actief is. Default is true.
pt: Especifica se o sistema está ativado. O padrão é verdadeiro.
ru: Указывает, включён ли клиент. По умолчанию значение равно true.
sv: Specificerar om en klient är aktiverad. Standardvärde, aktiverad.

# Enabled_Label
source: Enabled
ar: مفعل
es: Habilitado
fr: Activé
nl: Actief
pt: Ativado
ru: Включён!
sv: Aktiv

# EnableLocalLogin_Info
source: Specifies if this client can use local accounts, or external IdPs only. Defaults to true.
ar: يحدد فيما اذا كان العميل يستخدم حسابات محلية او حسابات مزودي هوية خارجيين فقط. الافتراض هو نعم
es: Especifica si el cliente puede usar cuentas locales o solo proveedores de identidad externos. Habilitado por defecto.
fr: Indique si ce client peut utiliser des comptes locaux, ou uniquement des IdPs externes . La valeur par défaut est Vrai.
nl: Geeft aan of de client lokale accounts mag gebruiken of uitsluitend externe IdP's (Identity Providers). Default is true.
pt: Especifica se este sistema pode usar contar locais ou apenas IDPs externos. O padrão é verdadeiro.
ru: Указывает, может ли этот клиент использовать локальные учетные записи или только внешние IdPs. По умолчанию значение равно true.
sv: Specificerar om denna klienten kan använda lokala konton eller bara externa konton. Standardvärde, aktiverad.

# EnableLocalLogin_Label
source: Enable Local Login
ar: تفعيل تسجيل الدخول المحلي
es: Habilitar el inicio de sesión local
fr: Activer la connexion locale
nl: Sta Local Login toe
pt: Ativar login local
ru: Включить Локальный Вход
sv: Tillåt lokala konton

# IdentityTokenLifetime_Info
source: Lifetime to identity token in seconds (defaults to 300 seconds / 5 minutes)
ar: عمر رمز الهوية (identity token) بالثواني (الافتراضي 300 ثانية / 5 دقائق)
es: Tiempo de vida de la token de indentidad en segundos. 300 seconds / 5 minutes por defecto.
fr: Durée de vie du jeton d'identité en secondes (par défaut 300 secondes / 5 minutes)
nl: Geldigheid van het identity token in seconden (default is 300 seconden / 5 minuten)
pt: Duração da identidade do token em segundos (os padrões são 300 segundos / 5 minutos)
ru: Для определения срока действия токена в секундах (по умолчанию значение равно 300 секунд / 5 минут)
sv: Livstid på identitetstoken i sekunder (standardvärde 300 sekunder / 5 minuter)

# IdentityTokenLifetime_Label
source: Identity Token Lifetime
ar: عمر رمز الهوية (Identity Token)
es: Tiempo de vida del token de identidad
fr: Durée de vie du jeton d'identité
nl: Geldigheid Identity Token
pt: Duração da identidade do token
ru: Подлинность Срока действия Токена
sv: Livstid på identitetstoken

# IncludeJwtId_Info
source: Specifies whether JWT access tokens should have an embedded unique ID (via the jti claim).
ar: يحدد فيما اذا كان رموز الوصول من نوع (jwt) يجب ان يضمنوا بمعرف فريد (بواسطة مطالبة jti)
es: Especifica si las tokens de acceso JWT deberian tener una ID unica integrada (via la reclamación JTI).
fr: Indique si les jetons d'accès JWT doivent avoir un ID unique intégré (via jti claim).
nl: Geeft aan of JWT access tokens een unieke embedded ID moeten bevatten (via de JTI claim)
pt: Especifica se os acessos JWT do token devem ter ID exclusivo incorporado (por meio de permissão JTI).
ru: Указывает, должны ли JWT токены доступа иметь встроенный уникальный идентификатор (через утверждения jti).
sv: Specificera om JWT åtkomstnycklar skall ha ett unikt id inkluderat (via jti anspråk).

# IncludeJwtId_Label
source: Include Jwt Id
ar: تضمين معرف Jwt
es: Incluir la ID del JWT
fr: Inclure l'ID Jwt
nl: Voeg Jwt Id toe
pt: Incluir ID JWT
ru: Вкулючает Jwt идетнификатор (Id)
sv: Inkludera JWT id

# LogoUri_Info
source: URI to client logo (used on consent screen)
ar: رابط شعار العميل ( يستخدم في شاشة الموافقة)
es: URI del logo del cliente (usado en la pantalla de consentimiento).
fr: URI du logo du client (utilisé sur l'écran de consentement)
nl: URI voor client logo (gebruikt op het consentscherm)
pt: URI para o logo do sistema (usado na tela de consentimento)
ru: URI Унифицированный индикатор ресурса для лого клиента (используется на экране подтверждения)
sv: URI till client logotyp (används på medgivandesidan)

# LogoUri_Label
source: Logo Uri
ar: رابط الشعار
es: URI del logo
pt: Logo do URI
ru: Uri Лого
sv: Logotyp Uri

# RefreshTokenExpiration_Info
source: Absolute the refresh token will expire on a fixed point in time (specified by the AbsoluteRefreshTokenLifetime) Sliding when refreshing the token, the lifetime of the refresh token will be renewed (by the amount specified in SlidingRefreshTokenLifetime). The lifetime will not exceed AbsoluteRefreshTokenLifetime.
ar: ستنتهي صلاحية رمز التحديث المطلق في نقطة محددة من الزمن (محددة بواسطة AbsoluteRefereshTokenLiftime) يمدد عن تحديث الرموز ، وعمر رموز التحديث (refersh token) سيجدد (بمقدار SlidingRefereshTokenLifetime) . والعمر لن يتجاوز (AbsoluteRefereshTokenLiftime).
es: Absoluta: La token de refresco expirara en un punto fijo en el tiempo (especificado por AbsoluteRefreshTokenLifetime). Corrediza: Cuando se este refrescando la token, el tiempo de vida de la token de refresco sera renovado (especificado por SlidingRefreshTokenLifetime). El tiempo de vida no excederá a AbsoluteRefreshTokenLifetime.
fr: Absolute, le refresh token expirera à une date fixe (spécifiée par le paramètre AbsoluteRefreshTokenLifetime). Sliding, lors de la régénération du jeton, la durée de vie du refresh token sera renouvelée (de la quantité spécifiée par SlidingRefreshTokenLifetime). La durée de vie ne dépassera pas AbsoluteRefreshTokenLifetime.
nl: Absolute - het refresh token zal verlopen op een exact vast moment in tijd (met AbsoluteRefreshTokenLifetime). Sliding - wanneer het refresh token wordt vernieuwd dan zal de geldigheid van refresh token ook worden vernieuwd (met de hoeveelheid tijd aangegeven met SlidingRefreshTokenLifetime). De geldigheid kan nooit verder in de toekomst liggen dan de waarde aangegeven voor AbsoluteRefreshTokenLifetime).
pt: A atualização do token expirará num exato momento (especificado pela duração da atualização absoluta) Deslizar quando atualizar o token, a duração da atualização do token será renovada (pela quantidade específica em duração de deslize da atualização do token). A duração não excederá a duração absoluta da atualização do token
ru: Срок абсолютного токен обновления истекает в определенный момент времени (определяется СрокомДействияАбсолютногоОбновленияТокена) Скольжение при обновлении токена, время действия обновления токена будет обновлено (на велечину указанную в СрокеДействияСкользащегоОбновленияТокена). Срок действия не привысит СрокДействияАбсолютногоОбновленияТокена.
sv: Absolut uppdateringstoken kommer att upphöra vie en viss tid (specificerad av AbsoluteRefreshTokenLifetime) Glider när token uppdateras, livstiden på uppdateringstoken kommer att förnyas (med värdet son är specificerat av SlidingRefreshTokenLifetime). Livstiden kommer inte överstiga AbsoluteRefreshTokenLifetime.

# RefreshTokenExpiration_Label
source: Refresh Token Expiration
ar: نفاذ رموز التحديث (Referesh Token)
es: Expiración de la token de refresco
fr: Expiration du refresh token
nl: Refresh Token geldigheid
pt: Atualizar expiração do token
ru: Обновление Срока Действия Токена
sv: Utgång av uppdateringstoken

# RefreshTokenUsage.Info
source: ReUse the refresh token handle will stay the same when refreshing tokens OneTime the refresh token handle will be updated when refreshing tokens
ar: إعادة استخدام مقبض رمز التحديث سيبقى كما هو عند تحديث الرموز المميزة سيتم تحديث مقبض رمز التحديث في OneTime عند تحديث الرموز المميزة
es: ReUse: El tirador de la token de refresco se mantendra igual cuando se refresquen tokens. OneTime: El tirador de la token de refresco sera actualizada cuando se refresquen tokens.
fr: ReUse, la gestion des refresh token restera inchangée lors de la régénération des jetons. OneTime, la gestion des refresh tokens sera mise à jour lors de la régénération des jetons.
nl: ReUse - de refresh token handle blijft hetzelfde wanneer het token wordt vernieuwd. OneTime - de refresh token handle wordt vernieuwd wanneer het refresh token wordt vernieuwd.
pt: Reutilizar o identificador de autalização do token permanecerá o mesmo quando atualizar tokens O identificador de atualização será atualizado ao utilizar tokens uma vez
ru: Повторное использование обновления обработчика токена останется прежним при обновлении токенов Одноразовый обновляющий обработчик токена будет модернизирован при обновлении токенов
sv: ReUse, uppdateringstoken kommer inte att ändras när token uppdateras OneTime, uppdateringstoken kommer att ändras när token uppdateras
