Repository: skoruba/IdentityServer4.Admin
Catalog: src/Skoruba.IdentityServer4.Admin.UI/Resources/Areas/AdminUI/Views/Configuration/Client/Section/Label.*.resx
Languages: ar, es, fr, nl, pt, ru, sv

# ClientClaimsPrefix_Info
source: If set, the prefix client claim types will be prefixed with. Defaults to client_. The intent is to make sure they don’t accidentally collide with user claims.
ar: في حالة التفعيل بادئة (prefix) انوع مطالبات العميل (client calim types) ستبتدء بها. الافتراضي هو (client_) والنية ستكون لغرض التأكد من عدم التضارب عن طريق الخطأ بينها وبين مطالبات المستخدم.
es: Si es establecido, las reclamaciones de client usaran este prefijo. "client_" por defecto. La intencion es hacer que estas no entren en conflicto demanera accidental con las reclamaciones de usuario.
fr: Si cette option est activée, les prefix client claim types seront précédés d'un préfixe. Par défaut : client_. L'objectif est de s'assurer qu'ils n'entrent pas accidentellement en collision avec les user claims.
nl: Als hier een waarde is ingevuld zal deze waarde worden toegevoegd als prefix aan client claims. Default waarde is client_. Het doel van de prefix is om verwarring tussen client claims en user claims te voorkomen.
pt: Se definido, os tipos de permissão do sistema de prefixo serão prefixados. O padrão é client_. A intenção é garantir que eles não colidam acidentalmente com as reclamações do usuário
ru: Если задано, префикс типов клиентских утверждений будет c префиксом по умолчанию _client. Смысл в том чтобы убедиться, что они случайно не конфликтовали с утверждениями пользователя.
sv: Om satt, kommer prefix:et att användas som prefix till klientanspråk. Standardvärde är client_. Avsikten är att de inte skall blandas ihop med användaranspråk.

# ClientClaimsPrefix_Label
source: Client Claims Prefix
ar: بادئة (prefix) مطالبات العميل
es: Prefijo de reclamaciones de cliente
fr: Préfixe claims client
pt: Prefixo de permissões do sistema
ru: Префикс Утверждений Клиента
sv: KlientInformationsprefix

# Description_Info
source: Client Description
ar: وصف العميل
es: Descripción de cliente
fr: Description Client
nl: Client omschrijving
pt: Descrição do sistema
ru: Описание Клиента
sv: Klientbeskrivning

# Description_Label
source: Description
ar: الوصف
es: Descripción
nl: Omschrijving
pt: Descrição
ru: Описание
sv: Beskrivning

# FrontChannelLogoutSessionRequired_Info
source: Specifies if the user’s session id should be sent to the FrontChannelLogoutUri. Defaults to true.
ar: يحدد فيما اذا كان معرف جلسة المستخدم (user's session id) يجب ارساله الى رابط قناة تسجيل الخروج الامامية (ForntChannelLogoutUri). الافتراضي هو نعم.
es: Especifica si la ID de sesión del usuario deberia ser enviada a la FrontChannelLogoutUri. Habilitado por defecto.
fr: Indique si l'id de session de l'utilisateur doit être envoyé à FrontChannelLogoutUri. La valeur par défaut est Vraie.
nl: Geeft aan of de user's session id verzonden moet worden naar de FrontChannelLogoutUri. Default is true.
pt: Especifica se o ID da sessão do usuário deve se enviado ao URI de logout do canal frontal. O padrão é verdadeiro.
ru: Указывает, должен ли идентификатор сеанса пользователя отправляться к FrontChannelLogoutUri. По умолчанию значение равно true.
sv: Specificera om en användares sessions id skall skickas till FrontChannelLogoutUri. Standardvärde, aktiverad.

# FrontChannelLogoutSessionRequired_Label
source: Front Channel Logout Session Required
ar: جلسة قناة تسجيل الخروج الامامية مطلوبة
es: Requiere canal frontal de cierre de sesión
fr: Session de déconnexion Front Channel requise
nl: Front Channel Logout Session Vereist
pt: Sessão de logout do canal frontal necessária
ru: Требуется Передний Канал Выхода из Сессии
sv: Kräv session till Front Channel Logout

# FrontChannelLogoutUri_Info
source: Specifies logout URI at client for HTTP based front-channel logout. See the OIDC Front-Channel spec for more details.
ar: يحدد فيما اذا عنوان تسجيل الخروج (Logout Uri) في Http العميل من نوع القناة الامامية (Http based front-channel)
es: Especifica la URI de cierre de sesión en el cliente para el cierre de sesión via canal frontal basado en HTTP. Ve la especificación del canal frontal de OIDC para más detalles.
fr: Indique l'URI de déconnexion au niveau du client pour la déconnexion HTTP Front Channel. Voir les spécifications du Front-Channel de l'OIDC pour plus de détails.
nl: Geeft de logout URI aan voor een client in geval van een HTTP-gebaseerde front-channel logout. Zie ook de OIDC Front-Channel specificatie voor meer informatie.
pt: Especificar o URI de logout no sistema para logout do canal frontal baseado em http. Consulte a especificação do canal frontal do OIDC para obter mais detalhes.
ru: Указывает на выход клиента из URI для выхода на сервер на основе протокола HTTP. Для дальнейшей информации, смотрите спецификацию переднего канала OIDC.
sv: Specificera utloggnings uri hos klient för http baserad front kanal utloggning. Se OIDC Front-Channel spec för mer detaljer.

# FrontChannelLogoutUri_Label
source: Front Channel Logout Uri
ar: رابط قناة تسجيل الخروج الامامية Front Channel Logout Uri
es: URI del canal frontal de cierre de sesión
fr: Uri de déconnexion pour le Front Channel
pt: URI de logout do canal frontal
ru: URI Выход Переднего Канала

# PairWiseSubjectSalt_Info
source: Salt value used in pair-wise subjectId generation for users of this client.
ar: قيمة الملح (salt value) المستخدمة في (pair-wise subjectId) المولد لمستخدمي العميل
es: Valor de la sal usada en la generación de subjectId por sabido para usuarios de este cliente.
fr: Valeur de sel utilisée pour la génération pair-wise du subjectId pour les utilisateurs de ce client.
nl: Salt waarde gebruikt tijdens pair-wise subjectId generatie voor users van deze client.
pt: Valor de sal usado na geração de ID do sujeito em pares para usuários deste sistema.
ru: Значение Соли(модификатора), используемое в генерации идентификатора парного объекта (subjectId) для пользователей этого клиента.
sv: Saltvärde som används vid parvis subjekt id generering för användare av denna klient.

# Properties_Info
source: Dictionary to hold any custom client-specific values as needed.
ar: قاموس لحفظ اي قيمة مخصصة حسب الحاجة
es: Diccionario para mantener cualquier valor personalizado especifico de cliente según sea necesario.
fr: Dictionnaire pour contenir autant de valeurs personnalisées spécifiques au client que nécessaire.
nl: Een dictionary met custom client-specifieke waarden, vrij toe te passen.
pt: Dicionário para armazenar quaisquer valores específicos do sistema personalizados, conforme necessário .
ru: Словарь для хранения любых пользовательских значений для клиента.
sv: Lista som håller skräddarsydda klientspecifika värden som behöves.

# Properties_Label
source: Properties
ar: الخصائص
es: Propiedades
fr: Propriétés
pt: Propriedades
ru: Свойства
sv: Egenskaper

# PropertyKey_Info
source: Key
ar: المفتاح
es: Llave
fr: Clé
pt: Chave
ru: Ключ
sv: Nyckel

# PropertyKey_Label
source: Key
ar: المفتاح
es: Llave
fr: Clé
pt: Chave
ru: Ключ
sv: Nyckel

# PropertyValue_Info
source: Value
ar: القيمة
es: Valor
fr: Valeur
pt: Valor
ru: Значение
sv: Värde

# PropertyValue_Label
source: Value
ar: القيمة
es: Valor
fr: Valeur
pt: Valor
ru: Значение
sv: Värde

# ProtocolType_Info
source: Default is OpenID Connect protocol
ar: الافتراضي هو بروتوكل OpenId Connect
es: El protocolo OpenID Connect por defecto.
fr: Par défaut, le protocole OpenID Connect est utilisé.
pt: O padrão é o protocolo OpenID Connect
ru: По умолчанию OpenID Connect протокол
sv: Standardvärde är OpenID Connect protokollet

# ProtocolType_Label
source: Protocol Type
ar: نوع البروتوكول
es: Tipo de protocolo
fr: Type de protocole
pt: Tipo de protocolo
ru: Тип Протокола
sv: Protokolltyp

# UserSsoLifetime_Info
source: The maximum duration (in seconds) since the last time the user authenticated. Defaults to null
ar: الفترة القصوى (بالثواني) منذ اخر مرة تفويض للمستخدم. الافتراضي هو null
es: La duración máxima (en segundos) desde la ultima vez que el usuario se autentico. Nulo por defecto.
fr: La durée maximale (en secondes) depuis la dernière authentification de l'utilisateur. La valeur par défaut est nulle.
nl: De maximale lengte (in seconden) sinds de laatste keer dat een user succesvol geautenticeerd was. Default is null.
pt: A duração máxima (em segundos) desde a última vez que o usuário foi autenticado. O padrão é nulo
ru: Максимальная продолжительность (в секундах) с момента последней аутентификации пользователя. По умолчанию null
sv: Maximal tid (i sekunder) sedan användaren autentiserade sig. Standardvärde, null

# UserSsoLifetime_Label
source: User Sso Lifetime
ar: استخدم مدة Sso
es: Tiempo de vida del SSO del usuario
fr: Durée de vie du SSO de l'utilisateur
nl: User Sso Geldigheid
pt: Duração do usuário Sso
ru: Срок службы единого входа в систему (Sso) Пользователя
sv: Användarens Single Sign On livstid

# DeviceCodeLifetime_Info
source: Lifetime to device code in seconds (defaults to 300 seconds / 5 minutes)
ar: عمر رمز الجهاز في الثواني ( الافتراضي هو 300 ثانية / 5 دقائق)
es: Tiempo de vida del código de dispositivo en segundos. 300 segundos / 5 minutos por defecto.
fr: Durée de vie du code de l'appareil en secondes (par défaut : 300 secondes / 5 minutes)
nl: Geldigheid van device code in seconden (default is 300 seconden / 5 minuten)
pt: Duração do código do dispositivo em segundos (o padrão é 300 segundos / 5 minutos)
ru: Срок службы кода устройства в секундах (по умолчанию 300 секунд / 5 минут)
sv: Livstid för enhetskod i sekunder (standardvörde 300 sekunder / 5 minuter)

# DeviceCodeLifetime_Label
source: Device Code Lifetime
ar: عمر رمز الجهاز
es: Tiempo de vida del código de despositivo
fr: Durée de vie du code de l'appareil
nl: Device Code geldigheid
pt: Duração do código do dispositivo
ru: Срок службы кода устройства
sv: Livstid på enhetskod

# UserCodeType_Info
source: Specifies the type of user code to use for the client. Otherwise falls back to default.
ar: يحدد النوع الخاص رمز المستخدم ليستخدم خلال العميل. بعكس ذلك الرجوع الى الافتراضي.
es: Especifica el tipo de código de usuario a usar por el cliente. De lo contrario utiliza default.
fr: Indique le type de code utilisateur à utiliser pour le client. Dans le cas contraire, le système revient à la valeur par défaut.
nl: Geeft aan welk type user code gebruikt moet worden voor de client. Default wordt anders gebruikt.
pt: Especificar o tipo de código do usuário a ser usado para o sistema. Caso contrário, volta para o padrão.
ru: Определяет тип кода пользователя, который будет использоваться для клиента. В противном случае возвращается значение по умолчанию.
sv: Specificera användarkodtyp att använda i klienten. I annat fall används standardvärde.

# UserCodeType_Label
source: User Code Type
ar: نوع رمز المستخدم
es: Tipo de código de usuario
fr: Type de code utilisateur
pt: Tipo de código do usuário
ru: Тип Кода Пользователя
sv: Användarkodtyp

# Expiration_Info
source: Expiration
ar: النفاذ
es: Expiración
nl: Verlopen
pt: Expiração
ru: Срок действия
sv: Förfallodatum

# Expiration_Label
source: Expiration
ar: النفاذ
es: Expiración
nl: Verlopen
pt: Expiração
ru: Срок действия
sv: Förfallodatum

# SecretDescription_Info
source: Description
ar: الوصف
es: Descripción
nl: Omschrijving
pt: Descrição
ru: Описание
sv: Beskrivning

# SecretDescription_Label
source: Description
ar: الوصف
es: Descripción
nl: Omschrijving
pt: Descrição
ru: Описание
sv: Beskrivning

# RequireRequestObject_Label
source: Require Request Object
ar: طلب الكائن (object) مطلوب

# RequireRequestObject_Info
source: Specifies whether this client needs to wrap the authorize request parameters in a JWT (defaults to false)
ar: يحدد فيما اذا كان العميل بحاجة الى طلب تفويض ضمن (JWT) الافتراضي هو نعم

# SigningAlgorithms_Label
source: Allowed Identity Token Signing Algorithms
ar: السماح لتوقيع خوارزمية الرموز الهوية

# SigningAlgorithms_Info
source: List of allowed signing algorithms for identity token. If empty, will use the server default signing algorithm.
ar: قائمة بخوارزميات توقيع رموز الهوية (Identity Token signing algorithm) ، اذا تركت فارغة ستستخدم الخوارمزية الافتراضية للخادم.

# PairWiseSubjectSalt_Label
source: Pair Wise Subject Salt
es: Sal del sujeto por sabido
fr: Sallage PairWise du sujet
pt: Sal de assuntos pareados
ru: Соль(модификатор) Парного Объекта
sv: Parvis subjekt salt
