Repository: skoruba/IdentityServer4.Admin
Catalog: src/Skoruba.IdentityServer4.Admin.UI/Resources/Areas/AdminUI/Views/Configuration/Client/Section/Label.*.resx
Languages: ar, es, fr, nl, pt, ru, sv

# RefreshTokenUsage.Label
source: Refresh Token Usage
ar: استخدام رموز التحديث (Referesh Token)
es: Uso de la token de refresco
fr: Utilisation des refresh token
nl: Refresh Token gebruik
pt: Atualizar utilização do token
ru: Использование Обновления Токена
sv: Användande av uppdateringstoken

# RefreshTokenUsage_Info
source: ReUse the refresh token handle will stay the same when refreshing tokens OneTime the refresh token handle will be updated when refreshing tokens
ar: إعادة استخدام مقبض رمز التحديث سيبقى كما هو عند تحديث الرموز المميزة سيتم تحديث مقبض رمز التحديث في OneTime عند تحديث الرموز المميزة
es: ReUse: El tirador de la token de refresco se mantendra igual cuando se refresquen tokens. OneTime: El tirador de la token de refresco sera actualizada cuando se refresquen tokens.
fr: ReUse, la gestion des refresh token restera inchangée lors de la régénération des jetons OneTime, la gestion des refresh token sera mise à jour lors de la régénération des jetons
nl: ReUse - de refresh token handle blijft hetzelfde wanneer het token wordt vernieuwd. OneTime - de refresh token handle wordt vernieuwd wanneer het refresh token wordt vernieuwd.
pt: Reutilizar o identificador de autalização do token permanecerá o mesmo quando atualizar tokens O identificador de atualização será atualizado ao utilizar tokens uma vez
ru: Повторное использование обновления обработчика токена останется прежним при обновлении токенов Одноразовый обновляющий обработчик токена будет модернизирован при обновлении токенов
sv: ReUse, uppdateringstoken kommer inte att ändras när token uppdateras OneTime, uppdateringstoken kommer att ändras när token uppdateras

# RefreshTokenUsage_Label
source: Refresh Token Usage
ar: استخدام رموز التحديث (Refresh Token)
es: Uso de la token de refresco
fr: Utilisation des refresh token
nl: Refresh Token gebruik
pt: Atualizar utilização do token
ru: Использование Обновления Токена
sv: Användande av uppdateringstoken

# RequireClientSecret_Info
source: Specifies whether this client needs a secret to request tokens from the token endpoint (defaults to true)
ar: يحدد فيما اذا العميل بحاجة الى سر لطلب الرموز (tokens) من نقاط الرموز (token endpoint) الافتراضي هو نعم
es: Especifica si este cliente necesita un secreto para solicitar tokens desde un punto final de token. Habilitado por defecto.
fr: Indique si ce client a besoin d'un secret pour demander des jetons à partir du token endpoint (valeur par défaut : Vrai)
nl: Geeft aan of de client een secret vereist om tokens te mogen opvragen op het token endpoint (default is true)
pt: Especifica se este sistema precisa de um segredo para solicitar tokens do terminal do token (o padrão é verdadeiro)
ru: Указывает, нужен ли этому клиенту секрет для запроса токена из конечной точки токена (по умолчанию значение равно true)
sv: Specificera ifall klienten behöver en hemlighet för begära en uppdateringstoken från tokenändpunkten (standardvärde är aktiverad)

# RequireClientSecret_Label
source: Require Client Secret
ar: سر العميل مطلوب
es: Requiere secreto de cliente
fr: Exiger le secret client
nl: Client Secret vereist
pt: Exigir segredo do sistema
ru: Требуется Секрет Клиента
sv: Kräv klienthemlighet

# RequireConsent_Info
source: Specifies whether a consent screen is required. Defaults to true.
ar: يحدد فيما اذا كانت شاشاة الموافقة مطلوبة ( الافتراضي هو نعم)
es: Especifica si una pantalla de consentimiento es necesaria. Habilitado por defecto.
fr: Indique si un écran de consentement est exigé. La valeur par défaut est Vrai.
nl: Geeft aan of een consentscherm vereist is. Default is true.
pt: Especifica se uma tela de consentimento é necessária. O padrão é verdadeiro
ru: Указывает, требуется ли экран подтверждения. По умолчанию значение равно true.
sv: Specificera ifall medgivandesidan är obligatorisk. Standardvärde, aktiverad.

# RequireConsent_Label
source: Require Consent
ar: الموافقة مطلوبة
es: Requiere consentimiento
fr: Exiger le consentement
nl: Consent vereist
pt: Exigir consentimento
ru: Требуется Подтверждение
sv: Kräv medgivande

# RequirePkce_Info
source: Specifies whether clients using an authorization code based grant type must send a proof key
ar: يحدد فيما اذا كان العملاء يستخدمون اذن من نوع رمز التفويض (authorization code) ويجب ارسال مفتاح اثبات
es: Especifica si los clientes usando un tipo de concesión basado en código de autorización debe enviar una llave de evidencia
fr: Indique si les clients qui utilisent un type d'octroi basé sur un code d'autorisation doivent envoyer une proof key.
nl: Geeft aan of clients, welke gebruik maken van een authorization code gebaseerde grant type, bewijs moeten sturen in de vorm van een proof key
pt: Especifia se os sistemas que usam um tipo de concessão baseado em código de autorização devem enviar uma chave de prova
ru: Указывает, должны ли клиенты, использующие тип грантов на основе кода авторизации, отправлять подтверждающий ключ
sv: Specificera ifall kllienter som använder autentiseringskodbaserad medgivande måste skicka med bevistoken

# RequirePkce_Label
source: Require Pkce
ar: PKCE مطلوب
es: Requiere PKCE
fr: Nécessite PKCE
nl: PKCE vereist
pt: Exigir Pkce
ru: Требуется Ключ проверки для обмена кодом (Pkce)
sv: Kräv PKCE

# SlidingRefreshTokenLifetime_Info
source: Sliding lifetime of a refresh token in seconds. Defaults to 1296000 seconds / 15 days
ar: تمديد مدة رموز التحديث بالثواني. الافتراضي 1296000 / 15 يوم
es: Tiempo de vida corredizo de una token de refresco en segundos. 1296000 segundos / 15 dias por defecto.
fr: Sliding, Durée de vie du refresh token en secondes. La valeur par défaut est 1296000 secondes / 15 jours.
nl: Sliding lifetime van een refresh token in seconden. Defaults is 1296000 seconden / 15 dagen
pt: Duração deslizante de um token de atualização em segundos. O padrão é 1296000 segundos/ 15 dias
ru: Скользящий срок действия обновления токена в секундах. По умолчанию до 1296000 секунд / 15 дней
sv: Glidande livstid för en uppdateringstoken i sekunder. Standardvärde 1296000 sekunder / 15 dagar

# SlidingRefreshTokenLifetime_Label
source: Sliding Refresh Token Lifetime
ar: تمديد مدة رموز التحديث
es: Tiempo de vida corredizo de la token de refresco
fr: Durée de vie d'un refresh token (Sliding)
nl: Sliding Refresh Token geldigheid
pt: Duração da atualização do token deslizante
ru: Срок Действия скользящего обновления токена
sv: Glidande livstid för uppdateringstoken

# UpdateAccessTokenClaimsOnRefresh_Info
source: Gets or sets a value indicating whether the access token (and its claims) should be updated on a refresh token request.
ar: الحصول على أو تعيين قيمة تشير إلى ما إذا كان يجب تحديث رمز الوصول (والمطالبات الخاصة به) في طلب رمز التحديث.
es: Obtiene o establece un valor indicando si la token de acceso (y sus reclamaciones) deberian ser actualizadas en una petición de token de refresco.
fr: Obtenir ou définir une valeur indiquant si le jeton d'accès (et ses claims) doivent être mis à jour lors d'une demande de refresh token.
nl: Geeft aan of het access token (en bijbehorende claims) geupdate moet worden in geval van een refresh token request.
pt: Obtém ou define um valor indicando se o acesso do token (e suas declarações) deve sr atualizado em uma solicitação de atualização do token.
ru: Возвращает или задает значение, указывающее следует ли обновлять токен доступа (и его утверждения) при запросе маркера обновления.
sv: Uppdatera åtkomsttoken (och dess anspråk) när en uppdateringstoken begärs.

# UpdateAccessTokenClaimsOnRefresh_Label
source: Update Access Token Claims On Refresh
ar: تحديث مطالبات الرمز عند التحديث
es: Actualizar las reclamaciones de la token de acceso al refrescar
fr: Mise à jour des Claims de jetons d'accès lors d'une demande de refresh token
pt: Atualizar declarações de acesso do token ao atualizar
ru: Корректировка Утверждений Токена Доступа при Обновлении
sv: Uppdatera åtkomsttokenanspråk vid uppdatering av uppdateringstoken

# AllowedCorsOrigins_Info
source: If specified, will be used by the default CORS policy service implementations (In-Memory and EF) to build a CORS policy for JavaScript clients.
ar: اذا حددت، سيستخدم التمثيل الافتراضي لخدمة بوليصة CROS (in Memory and EF) لبناء بوليصة CORS لعملاء الجافا سكربت.
es: Si es especificado, puede ser usado por las implementaciones de servicio politicas de CORS por defecto (In-Memory y EF) para construir una politica de CORS para clientes de JavaScript.
fr: Si spécifié, sera utilisé avec l'implémentations par défaut des services de politique CORS (In-Memory et EF) pour construire une politique CORS pour les clients JavaScript.
nl: Indien gespecificeerd wordt dit gebruikt door de default CORS policy service implementaties (In-Memory en EF) om een CORS policy voor JavaScript clients te maken.
pt: Se especificado, o padrão do serviço de política CORS (In-MEmory e EF) será usado pelas implementações para criar uma política CORS para sistemas JavaScript.
ru: Если задано, будет использоваться реализация службы политики CORS по умолчанию (In-Memory и EF) для построения политики CORS для клиентов JavaScript.
sv: Om aktiverad, kommer standard CORS policy service implementationer (In-Memory och EF) att skapa CORS policys för JavaScript klienter.

# AllowedCorsOrigins_Label
source: Allowed Cors Origins
ar: السماج بمنشأ CORS
es: Origenes CORS permitidos
fr: Origines CORS autorisées
nl: Toegestane CORS origins
pt: Origens do CORS permitidas
ru: Разрешенные происхождения кросс-доменных запросов (Cors Origins)
sv: Tillåt CORS ursprung

# AllowedGrantTypes_Info
source: Specifies the grant types the client is allowed to use. Use the GrantTypes class for common combinations. List of default grants: Implicit Grant - (implicit), Client Credentials Grant - (client_credentials), Authorization Code Grant - (authorization_code), Hybrid grant - (hybrid), Resource Owner Password Credentials Grant - (password)
ar: يحدد انواع الاذونات التي يستخدمها العميل.
es: Especifica los tipos de concesiones el cliente tiene permitido usar. Usa la clase GrantTypes para combinaciones comunes. Lista de concesiones por defecto: Concesión implicita - (implicit), Concesión de credenciales de cliente - (client_credentials), Concesión de codigo de autorización - (authorization_code), Concesión híbrida - (hybrid), Concesió de credenciales de contraseña del propietario del recurso - (password)
fr: Indique les types d'octroi que le client peut utiliser. Utilisez la class GrantTypes pour les combinaisons courantes. Liste des octroi par défaut: Octroi implicite - (implicit), Octroi par identifiants - (client_credentials), Octroi par code - (authorization_code), Octroi hybride - (hybrid), Resource Owner Password Credentials Grant - (password)
nl: Geeft aan welke grant types voor deze client zijn toegestaan. Maak gebruikt van class GrantTypes voor gebruikelijke combinaties. Lijst met default grants: Implicit Grant - (implicit), Client Credentials Grant - (client_credentials), Authorization Code Grant - (authorization_code), Hybrid grant - (hybrid), Resource Owner Password Credentials Grant - (password)
pt: Especifica os tipos de concessão que o sistema tem permissão para usar. Utilize a classe de tipos de concessão para combinações comuns. Lista de concessões padrão: Concessão Implícita - (implicit), Concessão de Credenciais de Sistemas - (client_credentials), Concessão do código de autorização - (authorization_code), Concessão Híbrida (hybrid), Concessão de credenciais de senha do proprietário do recurso -(password)
ru: Указывает , какой тип прав позволено использовать клиенту. Используйте класс Типы Прав для общих соединений. Список Прав по умолчанию: Неявное Право - (implicit), Право Предоставление Учетных Данных Клиента - (client_credentials), Право Авторизации Кода - (authorization_code), Гибритный Грант - (hybrid), Право Предоставления Учетных данных владельца ресурса - (пароль)
sv: Specificera medgivandetyper klienten tillåts använda. Använd medgvandetyp klass för vanliga kombinationer. Lista av standard medgivanden: Implicit Grant - (implicit), Client Credentials Grant - (client_credentials), Authorization Code Grant - (authorization_code), Hybrid grant - (hybrid), Resource Owner Password Credentials Grant - (password)

# AllowedGrantTypes_Label
source: Allowed Grant Types
ar: انواع الاذونات المسموحة
es: Tipos de concesión permitidas
fr: Types d'octroi autorisés
nl: Toegestane Grant Types
pt: Tipos de concessão permitidos
ru: Разрешенные Типы Прав
sv: Tillåtna medgivandetyper

# AllowedScopes_Info
source: By default a client has no access to any resources - specify the allowed resources by adding the corresponding scopes names
ar: افتراضيا العميل لا يملك حق الوصول لاي مورد ، حدد الموراد المسموحة عن طريق اضافة اسماء المديات المرتبطة بالعميل.
es: Por defecto un cliente no tiene acceso a ningun recurso - especifica los recursos permitidos añadiendo los nombres de alcance correspondientes.
fr: Par défaut, un client n'a accès à aucune ressource - indiquez les ressources accessibles en ajoutant les noms de scopes correspondants.
nl: Een client heeft standaard geen toegang tot resources - bepaal de resources waar toegang aan verschaft moet worden door ze toe te voegen met de corresponderende scope names.
pt: Por padrão, um sistema não tem acesso a nenhum recurso - especifique os recursos permitidos adicionando os nomes de escopos correspondentes
ru: По умолчанию клиент не имеет доступа ни к одному ресурсу - укажите разрешенные ресурсы, добавив соответствующие имена областей
sv: Som standard saknar klienter rättigheter till resurser - specificera tillåtna resurser genom att lägga till respektive begränsningsnamn på resurs

# AllowedScopes_Label
source: Allowed Scopes
ar: المديات المسموجة
es: Alcances permitidos
fr: Scopes autorisés
nl: Toegestane Scopes
pt: Escopos permitidos
ru: Разрешенные области
sv: Tillåtna begränsningar

# Claims_Info
source: Allows settings claims for the client (will be included in the access token).
ar: السماح لتضمين المطالبات للعميل ( ستكون مضمنة في نقاط الوصول access token)
es: Permite establecer reclamaciones para el cliente (seran incluidas en el token de acceso).
fr: Permet de paramétrer les claims pour le client (sera inclus dans le jeton d'accès).
nl: Staat settings claims toe voor de client (zal worden toegevoegd aan het access token).
pt: Permite permissões de configurações para o sistema (serão incluídas no acesso do token).
ru: Позволяет настраивать утверждения для клиента (будут включены в токен доступа).
sv: Tillåt klient begränsningar för klienten (kommer att inkluderas i åtkomsttoken).

# Claims_Label
source: Claims
ar: المطالبات
es: Reclamaciones
pt: Permissões
ru: Утверждения
sv: Anspråk

# ClientSecrets_Info
source: List of client secrets - credentials to access the token endpoint.
ar: قائمة باسرار واعتمادات العميل للوصول الي النقطة النهائية للوصول (token endpoint)
es: Lista de secretos de cliente - credenciales para acceder al punto final del token.
fr: Liste des secrets clients - informations d'identification pour accéder au token endpoint.
nl: Lijst met client secrets - credentials om het token endpoint mee aan te roepen
pt: Lista de segredos do sistema - credenciais para acessar o terminal do token.
ru: Список секретов клиента - учетные данные для доступа к конечной точке токена
sv: Lista med klienthemligheter - uppgifter för åtkomst av tokenändpunkt.

# ClientSecrets_Label
source: Client Secrets
ar: اسرار العميل
es: Secretos del cliente
fr: Secrets Client
pt: Segredos do sistema
ru: Секрет Клиента
sv: Klienthemligheter

# IdentityProviderRestrictions_Info
source: Specifies which external IdPs can be used with this client (if list is empty all IdPs are allowed). Defaults to empty.
ar: يحدد فيما اذا كان مزودي الهوية الخارجيين (IdPs) باستطاعتهم استخدام هذا العميل (اذا كانت القائمة فارغة سيسمح لجميع موزدي الهوية
es: Especifica cuales proveedores de identidad externos pueden ser usados con este cliente (puede usarse todos los proveedores de identidad externos si la lista esta vacia). Vacio por defecto.
fr: Indique quels IdP externes peuvent être utilisés avec ce client (si la liste est vide, tous les IdP sont autorisés). La valeur par défaut est vide.
nl: Geeft aan welke externe IdP's gebruikt mogen worden voor deze client (als niet is opgegeven worden alle IdP's toegestaan). Default is een lege waarde.
pt: Especifica quais IDPs externos podem ser usados com este sistema (se a lista extiver vazia, todos os IDPs serão permitidos). O padrão é vazio.
ru: Указывает, какие внешние IdPs могут использоваться с этим клиентом ( если список пустой все IdPs разрешены). По умолчанию пусто.
sv: Specificera vilka externa kontoleverantörer som kan användas med denna klienten (om listan är tom tillåts alla tänster). Standardvärde, tomt.

# IdentityProviderRestrictions_Label
source: Identity Provider Restrictions
ar: محددات مزودي الهوية (Identity Provider IdP)
es: Restricciones de proveedor de identidad
fr: Restrictions concernant les fournisseurs d'identité
nl: Identity Provider Restricties
pt: Restrições ao provedor de identidade
ru: Ограничения Поставщика Цифровых Удостоверений
sv: Begränsa kontotleverantörer

# PostLogoutRedirectUris_Info
source: Specifies allowed URIs to redirect to after logout
ar: يحدد السماح للروابط باعادة التوجية بعد تسجيل الخروج
es: Especifica URIs a las que se puede redireccionar despues de un cierre de sesión.
fr: Indique les URI autorisées à rediriger vers après la déconnexion.
nl: Geeft aan welke redirect URIs toegestaan zijn na een logout
pt: Especifica os URIs permitidos para redirecionar após o logout
ru: Задает разрешеннные URIs для перенаправления после выхода из системы
sv: Specificera tillåtna Uri:er att vidarebefodra till efter utloggning

# PostLogoutRedirectUris_Label
source: Post Logout Redirect Uris
ar: روابط اعادة التوجية بعد تسجيل الخروج
es: URIs de redirección despues del cierre de sesión
fr: Uris de redirection après déconnexion
pt: URIs de redirecionamento de logout de postagem
ru: Перенаправление Выхода из системы Uris
sv: Godkända Post Logout Redirect uri:er efter utloggning

# RedirectUris_Info
source: Specifies the allowed URIs to return tokens or authorization codes to
ar: يحدد السماح للروابط بالرجوع الى الوصول
es: Especifica las URIs permitidas a la que es posible entregar tokens o códigos de authorización.
fr: Indique les URI autorisées à renvoyer les jetons ou les codes d'autorisation à
nl: Geeft aan wat de toegestane URIs zijn om tokens/authorization codes naar toe te sturen
pt: Especifica os URIs permitidos para retornar tokens ou códigos de autorização para
ru: Задает разрешенные URIs для возврата токенов или авторизации кодов
sv: Specificera tillåtna URI:er till returnycklar eller autentiseringskoder till

# RedirectUris_Label
source: Redirect Uris
ar: روابط اعادة التوجيه
es: URIs de redirección
fr: Uris de redirection
pt: Redirecionar URIs
ru: Переадресация адреса (Uri)
sv: Vidarebefodrings uri:er

# Type_Label
source: Claim Type
ar: نوع المطالبة
es: Tipo de reclamación
fr: Type Claim
pt: Tipo de permissão
ru: Тип Утверждения
sv: Anspråktyp

# Value_Label
source: Claim Value
ar: قيمة المطالبة
es: Valor de reclamación
fr: Valeur Claim
pt: Valor de permissão
ru: Значение Утверждения
sv: Anspråksvärde

# SecretType_Label
source: Secret Type
ar: نوع السر
es: Tipo de secreto
fr: Type Secret
pt: Tipo secreto
ru: Тип Секрета
sv: Hemlighetstyp

# SecretValue_Label
source: Secret Value
ar: قيمة السر
es: Valor del secreto
fr: Valeur Secret
pt: Valor secreto
ru: Значение Секрета
sv: Hemligt värde

# HashType_Label
source: Hash Type
ar: Hash نوع التجزئة
es: Tipo de hash
pt: Tipo de hash
ru: Тип Хеша
sv: Hash-typ

# RoleNormalizedName_Info
source: The Normalized Role Name
ar: اسم الدور (role) المعدل
es: Nombre del rol normalizado.
fr: Nom normalisé du rôle
nl: Genormaliseerde Role naam
pt: Nome do perfil normalizada
ru: Нормализованное Имя Роли
sv: Det normalizerade rollnamnet

# RoleNormalizedName_Label
source: Normalized Name
ar: الاسم المعدل
es: Nombre normalizado
fr: Nom normalisé
nl: Normaliseer naam
pt: Nome normalizado
ru: Нормализованное Имя
sv: Normalizerat rollnamn

# BackChannelLogoutSessionRequired_Info
source: Specifies if the user’s session id should be sent in the request to the BackChannelLogoutUri. Defaults to true.
ar: يحدد فيما اذا كان معرف الجلسة (session id) يجب ارساله في الطلب الى القناة الخلفية لتسجيل الخروج (BackChannelLogoutUri) . الافتراضي هو نعم
es: Especifica si la ID de sesión del usuario deberia ser enviada en la petición a la BackChannelLogoutUri. Habilitado por defecto.
fr: Indique si l'id de session de l'utilisateur doit être envoyé dans la demande au BackChannelLogoutUri. La valeur par défaut est Vrai.
nl: Geeft aan of de user's session id verzonden moet worden naar de BackChannelLogoutUri. Default is true.
pt: Especifica se o ID da sessão do usuário deve ser enviado na solicitação do URI de logout do canal de retorno. O padrão é verdadeiro
ru: Указывает, должен ли идентификатор сеанса пользователя отправляться в запросе на BackChannelLogoutUri. По умолчанию значение равно true.
sv: Specificerar om användarens sessions id skall skickas med till förfrågan om BackChannelLogoutUri. Standardvärde, aktiverat.

# BackChannelLogoutSessionRequired_Label
source: Back Channel Logout Session Required
ar: جلسة قناة قناة تسجيل الخروج الخلفية (BackChannelLogout) مطلوبة
es: Requiere canal trasero de cierre de sesión
fr: Session de déconnexion Back Channel requise
nl: Back Channel Logout Session is verplicht
pt: Sessão de logout do canal de retorno necessária
ru: Требуется Обратный Канал Выхода из Сессии
sv: Kräv session till Back Channel Logout

# BackChannelLogoutUri_Info
source: Specifies logout URI at client for HTTP based back-channel logout. See the OIDC Back-Channel spec for more details.
ar: يحدد فيما اذا عنوان تسجيل الخروج (Logout Uri) في Http العميل من نوع القناة الخلفية (Http based back-channel)
es: Especifica la URI de cierre de sesión en el cliente para el cierre de sesión vía canal trasero basadas en HTTP. Ve la especificación del canal trasero de OIDC para más detalles.
fr: Indique l'URI de déconnexion au niveau du client pour une déconnexion HTTP basée sur le back-channel. Voir les spécifications du Back-Channel de l'OIDC pour plus de détails.
nl: Bepaald de logout URI van een client voor een HTTP-gebaseerde back-channel logout. Zie ook de specificatie voor OIDC Back-Channel voor meer informatie.
pt: Especifica o URI de logout do sistema para o canal de retorno baseado em http. Consulte a especificação do canal de retorno OIDC para obter mais detalhes.
ru: Указывает на выход клиента из URI для выхода на сервер на основе протокола HTTP. Для дальнейшей информации, смотрите спецификацию обратного канала OIDC.
sv: Specificerar logut Uri hos klient för HTTP baserad back-channel utloggning. See OIDC Back-Channel spec för mer detaljer.

# BackChannelLogoutUri_Label
source: Back Channel Logout Uri
ar: رابط قناة تسجيل الخروج الخلفية Back Channel Logout Uri
es: URI del canal trasero de cierre de sesión
fr: Uri de déconnexion pour le Back Channel
pt: Logout URI do canal de retorno
ru: Uri Выхода из Системы Обратного Канала
