Repository: skoruba/IdentityServer4.Admin
Catalog: src/Skoruba.IdentityServer4.Admin/Resources/Views/Configuration/Client/Section/Label.*.resx
Languages: fa, zh_cn, zh_hant

# AbsoluteRefreshTokenLifetime_Info
source: Maximum lifetime of a refresh token in seconds. Defaults to 2592000 seconds / 30 days
fa: حداکثر طول عمر یک رفرش توکن در ثانیه. پیش فرض به 2592000 ثانیه / 30 روز
zh_cn: 刷新令牌的最长生命周期，以秒为单位。 默认为 2592000 秒/30 天
zh_hant: 刷新令牌的最長生命周期，以秒為單位。 預設為 2592000 秒/30 天

# AbsoluteRefreshTokenLifetime_Label
source: Absolute Refresh Token Lifetime
fa: طول عمر رفرش توکن خالص
zh_cn: 绝对刷新令牌生命周期
zh_hant: 絕對刷新令牌生命周期

# AccessTokenLifetime_Info
source: Lifetime of access token in seconds (defaults to 3600 seconds / 1 hour)
fa: طول عمر توکن دسترسی در ثانیه (پیش فرض به 3600 ثانیه / 1 ساعت)
zh_cn: 访问令牌的生命周期（以秒为单位）（默认为 3600 秒/1 小时）
zh_hant: 訪問令牌 access_token 的生命周期（以秒為單位）（預設為 3600 秒/1 小時）

# AccessTokenLifetime_Label
source: Access Token Lifetime
fa: طول عمر توکن دسترسی
zh_cn: 访问令牌生命周期
zh_hant: 訪問令牌生命周期

# AccessTokenTypes_Info
source: Specifies whether the access token is a reference token or a self contained JWT token (defaults to Jwt).
fa: مشخص می کند که آیا توکن دسترسی یک توکن رفرنس یا توکن JWT خوددار (پیش فرض به Jwt) است.
zh_cn: 指定访问令牌是引用令牌还是自包含 JWT 令牌（默认为 Jwt）。
zh_hant: 指定訪問令牌 access_token 是引用令牌还是自包含 JWT 令牌（預設為 Jwt）。

# AccessTokenTypes_Label
source: Access Token Type
fa: نوع توکن دسترسی
zh_cn: 访问令牌类型
zh_hant: 訪問令牌類型

# AllowAccessTokensViaBrowser_Info
source: Specifies whether this client is allowed to receive access tokens via the browser. This is useful to harden flows that allow multiple response types (e.g. by disallowing a hybrid flow client that is supposed to use code id_token to add the token response type and thus leaking the token to the browser.
fa: مشخص می کند که آیا این سرویس گیرنده مجاز به دریافت توکن های دسترسی از طریق مرورگر است. این برای جریان های سخت تر که انواع مختلف پاسخ را اجازه می دهد مفید است (مثلا با رد کردن یک سرویس گیرنده جریان ترکیبی که قرار است استفاده کند از کد id_token برای افزودن نوع توکن پاسخ و بنابراین توکن در مرورگر فاش می شود.)
zh_cn: 指定是否允许此客户端通过浏览器接收访问令牌。 这对于强化允许多种响应类型的流是有用的（例如，通过禁止应该使用代码 id_token 的混合流客户端来添加令牌响应类型并因此将令牌泄漏到浏览器。）
zh_hant: 指定是否允許此客戶端通過瀏覽器接收訪問令牌 access_token。 這對於强化允許多种回應類型的流是有用的（例如，通過禁止應該使用代碼身份令牌 id_token 的混合流客戶端來增加令牌回應類型並因此將令牌泄漏到瀏覽器。）

# AllowAccessTokensViaBrowser_Label
source: Allow Access Token Via Browser
fa: اجازه توکن دسترسی از طریق مرورگر
zh_cn: 允许通过浏览器访问令牌
zh_hant: 允許通過瀏覽器訪問令牌

# AllowOfflineAccess_Info
source: Specifies whether this client can request refresh tokens (be requesting the offline_access scope)
fa: مشخص می کند که آیا سرویس گیرنده می تواند توکن های رفرش را درخواست کند (درخواست کردن اسکوپ offline_access)
zh_cn: 指定此客户端是否可以请求刷新令牌（请求 offline_access 范围）
zh_hant: 指定此客戶端是否可以請求刷新令牌（請求 offline_access 作用域）

# AllowOfflineAccess_Label
source: Allow Offline Access
fa: اجازه دسترسی آفلاین
zh_cn: 允许离线访问
zh_hant: 允許離線訪問

# AllowPlainTextPkce_Info
source: Specifies whether clients using PKCE can use a plain text code challenge (not recommended - and default to false)
fa: مشخص می کند که آیا سرویس گیرنده هایی که از PKCE استفاده می کنند میتوانند از یک کد ساده متن استفاده کنند (توصیه نمی شود - و به طور پیش فرض به false)
zh_cn: 指定使用 PKCE 的客户端是否可以使用纯文本代码质询（不推荐 - 默认为 false）
zh_hant: 指定使用 PKCE 的客戶端是否可以使用純文本代碼諮詢（不推薦 - 預設為 false）

# AllowPlainTextPkce_Label
source: Allow Plain Text Pkce
fa: اجازه متن ساده Pkce
zh_cn: 允许纯文本 Pkce
zh_hant: 允許純文本 Pkce

# AllowRememberConsent_Info
source: Specifies whether user can choose to store consent decisions. Defaults to true.
fa: مشخص می کند که آیا کاربر می تواند تصمیمات موافقت را ذخیره کند یا خیر. پیش فرض true
zh_cn: 指定用户是否可以选择存储同意决策。 默认为 true。
zh_hant: 指定用戶是否可以選擇存储同意决策。 預設為 true。

# AllowRememberConsent_Label
source: Allow Remember Consent
fa: اجازه به خاطر داشتن موافقت
zh_cn: 允许记住同意
zh_hant: 允許記住同意

# AlwaysIncludeUserClaimsInIdToken_Label
source: Always Include User Claims In IdToken
fa: همیشه شامل ادعاهای کاربر در IdToken
zh_cn: 始终在标识令牌中包含用户声明
zh_hant: 始终在身份令牌中包含用戶聲明

# AlwaysSendClientClaims_Info
source: If set, the client claims will be sent for every flow. If not, only for client credentials flow (default is false)
fa: اگر تنظیم شود، ادعای سرویس گیرنده برای هر جریان ارسال می شود. اگر نه، فقط برای جریان اعتبار سرویس گیرنده (پیش فرض false)
zh_cn: 如果设置，将为每个流发送客户端声明。 如果不是，仅用于客户端凭证流（默认为 false）
zh_hant: 如果設置，將為每个流發送客戶端聲明。 如果不是，僅用於客戶端憑證流（預設為 false）

# AlwaysSendClientClaims_Label
source: Always Send Client Claims
fa: همیشه ادعاهای سرویس گیرنده ارسال شود
zh_cn: 始终发送客户端声明
zh_hant: 始终發送客戶端聲明

# AuthorizationCodeLifetime_Info
source: Lifetime of authorization code in seconds (defaults to 300 seconds / 5 minutes)
fa: طول عمر کد مجوز در ثانیه (پیش فرض به 300 ثانیه / 5 دقیقه)
zh_cn: 授权码的生命周期（以秒为单位）（默认为 300 秒/5 分钟）
zh_hant: 授權碼的生命周期（以秒為單位）（預設為 300 秒/5 分鍾）

# AuthorizationCodeLifetime_Label
source: Authorization Code Lifetime
fa: طول عمر کد مجوز
zh_cn: 授权码生命周期
zh_hant: 授權碼生命周期

# ClientId_Info
source: Unique ID of the client
fa: شناسه یکتاء سرویس گیرنده
zh_cn: 客户端的唯一标识
zh_hant: 客戶端的唯一標識

# ClientId_Label
source: ClientId
fa: شناسه سرویس گیرنده
zh_cn: 客户端标识
zh_hant: 客戶端標識

# ClientName_Info
source: Client display name (used for logging and consent screen)
fa: نام نمایشی سرویس گیرنده (برای صفحه ورود و موافقت استفاده می شود)
zh_cn: 客户端显示名称（用于记录和同意屏幕）
zh_hant: 客戶端顯示名稱（用於記錄和同意螢幕）

# ClientName_Label
source: Client Name
fa: نام سرویس گیرنده
zh_cn: 客户端名称
zh_hant: 客戶端名稱

# ClientUri_Info
source: URI to further information about client (used on consent screen)
fa: URI برای اطلاعات بیشتر در مورد سرویس گیرنده (در صفحه موافقت استفاده می شود)
zh_cn: 有关客户端的更多信息的URI（在同意屏幕上使用）
zh_hant: 有關客戶端的更多資訊的URI（在同意螢幕上使用）

# ClientUri_Label
source: Client Uri
fa: سرویس گیرنده Uri
zh_cn: 客户端 Uri
zh_hant: 客戶端 Uri

# AllowedCorsOrigins_Info
source: If specified, will be used by the default CORS policy service implementations (In-Memory and EF) to build a CORS policy for JavaScript clients.
fa: اگر مشخص شود, بصورت پیش فرض لا پیاده سازی های سرویس سیاست CORS استفاده خواهد شد (In-Memory و EF) برای ساخت یک سیاست CORS برای سرویس گیرنده ها JavaScript.
zh_cn: 如果指定，将由默认 CORS 策略服务实现（In-Memory 和 EF）用于为 JavaScript 客户端构建 CORS 策略。
zh_hant: 如果指定，將由預設 CORS 策略服務實現（In-Memory 和 EF）用於為 JavaScript 客戶端建構 CORS 策略。

# AllowedCorsOrigins_Label
source: Allowed Cors Origins
fa: مجاز Cors Origins
zh_cn: 允许跨域来源
zh_hant: 允許跨域來源

# AllowedGrantTypes_Info
source: Specifies the grant types the client is allowed to use. Use the GrantTypes class for common combinations. List of default grants: Implicit Grant - (implicit), Client Credentials Grant - (client_credentials), Authorization Code Grant - (authorization_code), Hybrid grant - (hybrid), Resource Owner Password Credentials Grant - (password)
fa: انواع واگذاری که سرویس گیرنده مجاز به استفاده است مشخص می کند. از کلاس GrantTypes برای ترکیب های معمول استفاده کنید. فهرست واگذاری های پیش فرض: واگذاری ضمنی - (implicit), واگذاری اعتبارات سرویس گیرنده - (client_credentials), واگذاری کد مجوز - (authorization_code), واگذاری ترکیبی - (hybrid), واگذاری گواهی نامه های کلمه عبور صاحب منبع - (password)
zh_cn: 指定允许客户端使用的授权类型。 使用 GrantTypes 类进行常见组合。 默认授权列表：隐式授权 - (implicit)，客户端凭证授权 - (client_credentials)，授权码授权 - (authorization_code)，混合授权 - (hybrid)，资源所有者密码凭证授权 - (password)
zh_hant: 指定允許客戶端使用的授權類型。 使用 GrantTypes 類進行常見组合。 預設授權列表：隱式授權 - (implicit)，客戶端憑證授權 - (client_credentials)，授權碼授權 - (authorization_code)，混合授權 - (hybrid)，資源所有者密碼憑證授權 - (password)

# AllowedGrantTypes_Label
source: Allowed Grant Types
fa: انواع واگذاری مجاز
zh_cn: 允许的授权类型
zh_hant: 允許的授權類型

# AllowedScopes_Info
source: By default a client has no access to any resources - specify the allowed resources by adding the corresponding scopes names
fa: بصورت پیش فرض یک سرویس گیرنده به هیچ منبعی دسترسی ندارد - بوسیله اضافه کردن نام های اسکوپ های مربوطه منابع مجاز را مشخص کنید
zh_cn: 默认情况下，客户端无权访问任何资源 - 通过添加相应的范围名称来指定允许的资源
zh_hant: 預設情况下，客戶端無權訪問任何資源 - 通過增加相應的作用域名稱來指定允許的資源

# AllowedScopes_Label
source: Allowed Scopes
fa: اسکوپ های مجاز
zh_cn: 允许的范围
zh_hant: 允許的作用域

# Claims_Info
source: Allows settings claims for the client (will be included in the access token).
fa: تنظیمات ادعاهای سرویس گیرنده را مجاز می کند (در توکن دسترسی گنجانده خواهد شد).
zh_cn: 允许客户端的设置声明（将包含在访问令牌中）。
zh_hant: 允許客戶端的設置聲明（將包含在訪問令牌 access_token 中）。

# Claims_Label
source: Claims
fa: ادعاها
zh_cn: 声明
zh_hant: 聲明

# ClientSecrets_Info
source: List of client secrets - credentials to access the token endpoint.
fa: فهرست رمزهای سرویس گیرنده - اعتبار دسترسی به توکن نقطه پایانی.
zh_cn: 客户端密钥列表 - 访问令牌端点的凭据。
zh_hant: 客戶端金鑰列表 - 訪問令牌 access_token 端點的憑據。

# ClientSecrets_Label
source: Client Secrets
fa: رمزهای سرویس گیرنده
zh_cn: 客户端密钥
zh_hant: 客戶端金鑰

# BackChannelLogoutSessionRequired_Info
source: Specifies if the user’s session id should be sent in the request to the BackChannelLogoutUri. Defaults to true.
fa: مشخص می کند که آیا شناسه سشن کاربر باید در درخواست به BackChannelLogoutUri ارسال شود. پیش فرض true.
zh_cn: 指定是否应在请求中将用户的会话 ID 发送到 BackChannelLogoutUri。 默认为 true。
zh_hant: 指定是否應在請求中將用戶的會話 ID 發送到 BackChannelLogoutUri。 預設為 true。

# BackChannelLogoutSessionRequired_Label
source: Back Channel Logout Session Required
fa: سشن کانال برگشت خروج ضروری است
zh_cn: 需要返回频道注销会话
zh_hant: 需要後端通道登出會話

# BackChannelLogoutUri_Info
source: Specifies logout URI at client for HTTP based back-channel logout. See the OIDC Back-Channel spec for more details.
fa: URI خروج سمت سرویس گیرنده را برای HTTP بر اساس back-channel خروج مشخص می کند . برای جزئیات بیشتر مشخصات OIDC Back-Channel را ببینید.
zh_cn: 指定客户端的注销 URI，以用于基于 HTTP 的反向通道注销。 有关详细信息，请参阅 OIDC Back-Channel 规范。
zh_hant: 指定客戶端的登出 URI，以用於基於 HTTP 的後端通道登出。 有關詳細資訊，請參閱 OIDC Back-Channel 規範。

# BackChannelLogoutUri_Label
source: Back Channel Logout Uri
fa: Uri کانال برگشت خروج
zh_cn: 返回频道退出 Uri
zh_hant: 後端通道退出 Uri

# ClientClaimsPrefix_Info
source: If set, the prefix client claim types will be prefixed with. Defaults to client_. The intent is to make sure they don’t accidentally collide with user claims.
fa: اگر تنظیم شود, پیشوند انواع ادعای سرویس گیرنده با آن پیشوند می شود. پیش فرض client_. هدف این است که اطمینان حاصل کنید که آنها به طور تصادفی با ادعاهای سرویس گیرنده برخورد نمی کنند.
zh_cn: 如果设置，客户端声明类型将以此为前缀。 默认为 client_。 目的是确保它们不会意外地与用户声明冲突。
zh_hant: 如果設置，客戶端聲明類型將以此為前綴。 預設為 client_。 目的是确保它们不會意外地與用戶聲明冲突。

# ClientClaimsPrefix_Label
source: Client Claims Prefix
fa: پیشوند ادعاهای سرویس گیرنده
zh_cn: 客户端声明前缀
zh_hant: 客戶端聲明前綴

# Description_Info
source: Client Description
fa: شرح سرویس گیرنده
zh_cn: 客户端描述
zh_hant: 客戶端描述

# Description_Label
source: Description
fa: شرح
zh_cn: 描述
zh_hant: 描述

# DeviceCodeLifetime_Info
source: Lifetime to device code in seconds (defaults to 300 seconds / 5 minutes)
fa: طول عمر به کد دستگاه در ثانیه (پیش فرض به 300 ثانیه / 5 دقیقه)
zh_hant: 設備代碼的生命周期（以秒為單位）（預設為 300 秒/5 分鍾）

# DeviceCodeLifetime_Label
source: Device Code Lifetime
fa: طول عمر کد دستگاه
zh_hant: 設備代碼生命周期

# Enabled_Info
source: Specifies if client is enabled. Defaults to true.
fa: مشخص می کند که آیا سرویس گیرنده فعال است. پیش فرض true.
zh_cn: 指定是否启用客户端。 默认为 true。
zh_hant: 指定是否啟用客戶端。 預設為 true。

# Enabled_Label
source: Enabled
fa: فعال
zh_cn: 启用
zh_hant: 啟用

# EnableLocalLogin_Info
source: Specifies if this client can use local accounts, or external IdPs only. Defaults to true.
fa: مشخص می کند که آیا این سرویس گیرنده می تواند از حساب های محلی، یا فقط IdP های خارجی استفاده کند. پیش فرض true
zh_cn: 指定此客户端是否可以使用本地帐户或仅外部 IdPs。 默认为 true。
zh_hant: 指定此客戶端是否可以使用本地帳戶或僅外部 IdPs。 預設為 true。

# EnableLocalLogin_Label
source: Enable Local Login
fa: ورود محلی را فعال کنید
zh_cn: 启用本地登录
zh_hant: 啟用本地登入

# FrontChannelLogoutSessionRequired_Info
source: Specifies if the user’s session id should be sent to the FrontChannelLogoutUri. Defaults to true.
fa: مشخص می کند که آیا شناسه سشن کاربر باید به FrontChannelLogoutUri ارسال شود. پیش فرض true.
zh_cn: 指定是否应将用户的会话标识发送到 FrontChannelLogoutUri。 默认为 true。
zh_hant: 指定是否應將用戶的會話標識發送到 FrontChannelLogoutUri。 預設為 true。

# FrontChannelLogoutSessionRequired_Label
source: Front Channel Logout Session Required
fa: سشن کانال جلو خروج ضروری است
zh_cn: 需要前台频道注销会话
zh_hant: 需要前端通道登出會話

# FrontChannelLogoutUri_Info
source: Specifies logout URI at client for HTTP based front-channel logout. See the OIDC Front-Channel spec for more details.
fa: URI خروج سمت سرویس گیرنده را برای HTTP بر اساس front-channel خروج مشخص می کند . برای جزئیات بیشتر مشخصات OIDC Front-Channel را ببینید.
zh_cn: 指定客户端的注销 URI，以用于基于 HTTP 的前端通道注销。 有关详细信息，请参阅 OIDC Front-Channel 规范。
zh_hant: 指定客戶端的登出 URI，以用於基於 HTTP 的前端通道登出。 有關詳細資訊，請參閱 OIDC Front-Channel 規範。

# FrontChannelLogoutUri_Label
source: Front Channel Logout Uri
fa: Uri کانال جلو خروج
zh_cn: 前台频道注销 Uri
zh_hant: 前端通道登出 Uri

# HashType_Label
source: Hash Type
fa: نوع هش
zh_cn: 哈希类型
zh_hant: 哈希類型

# IdentityProviderRestrictions_Info
source: Specifies which external IdPs can be used with this client (if list is empty all IdPs are allowed). Defaults to empty.
fa: مشخص می کند که کدام IdP های خارجی را می توان با این سرویس گیرنده مورد استفاده قرار داد (اگر فهرست خالی باشد، تمام IdP ها مجاز می باشند). پیش فرض خالی است.
zh_cn: 指定可以与此客户端一起使用的外部 IdPs（如果列表为空，则允许所有 IdPs）。 默认为空。
zh_hant: 指定可以與此客戶端一起使用的外部 IdPs（如果列表為空，則允許所有 IdPs）。 預設為空。

# IdentityProviderRestrictions_Label
source: Identity Provider Restrictions
fa: محدودیت های ارائه دهنده هویت
zh_cn: 身份提供程序限制
zh_hant: 身份提供程式限制

# IdentityTokenLifetime_Info
source: Lifetime to identity token in seconds (defaults to 300 seconds / 5 minutes)
fa: طول عمر تا توکن هویت در ثانیه (پیش فرض به 300 ثانیه / 5 دقیقه)
zh_cn: 标识令牌的生命周期（以秒为单位）（默认为 300 秒/5 分钟）
zh_hant: 身份令牌 id_token 的生命周期（以秒為單位）（預設為 300 秒/5 分鍾）

# IdentityTokenLifetime_Label
source: Identity Token Lifetime
fa: طول عمر توکن هویت
zh_cn: 身份令牌生命周期
zh_hant: 身份令牌生命周期

# IncludeJwtId_Info
source: Specifies whether JWT access tokens should have an embedded unique ID (via the jti claim).
fa: مشخص می کند که کدام توکن های دسترسی JWT باید دارای شناسه یکتاء تعبیه شده باشند (از طریق ادعای jti).
zh_cn: 指定 JWT 访问令牌是否应具有嵌入的唯一标识（通过 jti 声明）。
zh_hant: 指定 JWT 訪問令牌 access_token 是否應具有嵌入的唯一標識（通過 jti 聲明）。

# IncludeJwtId_Label
source: Include Jwt Id
fa: شامل Jwt Id
zh_cn: 包括 Jwt 标识
zh_hant: 包括 Jwt 標識

# LogoUri_Info
source: URI to client logo (used on consent screen)
fa: URI به لوگوی سرویس گیرنده (در صفحه موافقت استفاده شده)
zh_cn: 客户端徽标 URI（在同意屏幕上使用）
zh_hant: 客戶端徽標 URI（在同意螢幕上使用）

# LogoUri_Label
source: Logo Uri
fa: لوگو Uri
zh_cn: 徽标 Uri
zh_hant: 徽標 Uri

# PairWiseSubjectSalt_Info
source: Salt value used in pair-wise subjectId generation for users of this client.
fa: مقدار سالت استفاده شده در pair-wise subjectId تولید شده برای کاربران این سرویس گیرنده.
zh_cn: 对于此客户端的用户，在配对主题标识生成中使用的盐值。
zh_hant: 對於此客戶端的用戶，在配對主體標識生成中使用的鹽值。

# PairWiseSubjectSalt_Label
source: Pair Wise Subject Salt
zh_cn: 配对主题盐
zh_hant: 配對主體鹽

# PostLogoutRedirectUris_Info
source: Specifies allowed URIs to redirect to after logout
fa: URI های مجاز به تغییر مسیر پس از خروج را مشخص می کند
zh_cn: 指定在注销后重定向到允许的 URI
zh_hant: 指定在登出後重定向到允許的 URI

# PostLogoutRedirectUris_Label
source: Post Logout Redirect Uris
fa: Uri های تغییر مسیر خروج را ارسال می کند
zh_cn: 注销重定向 Uri
zh_hant: 登出重定向 Uri

# Properties_Info
source: Dictionary to hold any custom client-specific values as needed.
fa: دیکشنری برای نگهداری هر مقدار client-specific سفارشی مورد نیاز
zh_cn: 字典可根据需要保存任何自定义客户端特定值。
zh_hant: 字典可根據需要儲存任何自定義客戶端特定值。

# Properties_Label
source: Properties
fa: خواص
zh_cn: 属性
zh_hant: 屬性

# PropertyKey_Info
source: Key
fa: کلید
zh_cn: 键
zh_hant: 鍵值

# PropertyKey_Label
source: Key
fa: کلید
zh_cn: 键
zh_hant: 鍵值

# PropertyValue_Info
source: Value
fa: مقدار
zh_cn: 值
zh_hant: 值

# PropertyValue_Label
source: Value
fa: مقدار
zh_cn: 值
zh_hant: 值

# ProtocolType_Info
source: Default is OpenID Connect protocol
fa: پیش فرض پروتکل OpenID Connect
zh_cn: 默认为 OpenID Connect 协议
zh_hant: 預設為 OpenID Connect 協議

# ProtocolType_Label
source: Protocol Type
fa: نوع پروتکل
zh_cn: 协议类型
zh_hant: 協議類型

# RedirectUris_Info
source: Specifies the allowed URIs to return tokens or authorization codes to
fa: URI های مجاز را برای بازگرداندن توکن ها یا کدهای مجوز به مشخص می کند
zh_cn: 指定允许的 URI 以返回令牌或授权码
zh_hant: 指定允許的 URI 以返回令牌或授權碼

# RedirectUris_Label
source: Redirect Uris
fa: Uri های تغییر مسیر
zh_cn: 重定向 Uri
zh_hant: 重定向 Uri

# RefreshTokenExpiration_Info
source: Absolute the refresh token will expire on a fixed point in time (specified by the AbsoluteRefreshTokenLifetime) Sliding when refreshing the token, the lifetime of the refresh token will be renewed (by the amount specified in SlidingRefreshTokenLifetime). The lifetime will not exceed AbsoluteRefreshTokenLifetime.
fa: رفرش توکن خالص در یک نقطه ثابت زمان منقضی می شود (مشخص می شود با AbsoluteRefreshTokenLifetime) اسلایدینگ زمان تازه سازی توکن, طول عمر رفرش توکن تمدید می شود (با مقدار مشخص شده در SlidingRefreshTokenLifetime). طول عمر تجاوز نخواهد کرد از AbsoluteRefreshTokenLifetime.
zh_cn: Absolute 刷新令牌将在固定时间点到期（由 AbsoluteRefreshTokenLifetime 指定） Sliding 滚动刷新令牌，刷新令牌时生命周期将被更新（按 SlidingRefreshTokenLifetime 中指定的量）。 生命周期不会超过 AbsoluteRefreshTokenLifetime。
zh_hant: Absolute 絕對刷新令牌將在固定時間點到期（由“絕對刷新令牌生命周期”指定） Sliding 滾動刷新令牌，刷新令牌時生命周期將被更新（按“滾動刷新令牌生命周期”中指定的量）。生命周期不會超過“絕對刷新令牌生命周期”。

# RefreshTokenExpiration_Label
source: Refresh Token Expiration
fa: انقضاء رفرش توکن
zh_cn: 刷新令牌过期
zh_hant: 刷新令牌過期

# RefreshTokenUsage.Info
source: ReUse the refresh token handle will stay the same when refreshing tokens OneTime the refresh token handle will be updated when refreshing tokens
fa: استفاده مجدد از فرصت رفرش توکن همانند تازه سازی توکن ها خواهد شد یک مرتبه فرصت رفرش توکن بروزرسانی خواهد شد زمانی که توکن ها تازه سازی می شوند
zh_cn: ReUse 刷新令牌时，令牌句柄将保持不变 OneTime 刷新令牌时将更新令牌句柄
zh_hant: ReUse 刷新令牌時，令牌句柄將保持不变 OneTime 刷新令牌時將更新令牌句柄

# RefreshTokenUsage.Label
source: Refresh Token Usage
fa: کاربرد رفرش توکن
zh_cn: 刷新令牌使用情况
zh_hant: 刷新令牌使用情况

# RefreshTokenUsage_Info
source: ReUse the refresh token handle will stay the same when refreshing tokens OneTime the refresh token handle will be updated when refreshing tokens
fa: استفاده مجدد از فرصت رفرش توکن همانند تازه سازی توکن ها خواهد شد یک مرتبه فرصت رفرش توکن بروزرسانی خواهد شد زمانی که توکن ها تازه سازی می شوند
zh_cn: ReUse 刷新令牌时，令牌句柄将保持不变 OneTime 刷新令牌时将更新令牌句柄
zh_hant: ReUse 刷新令牌時，令牌句柄將保持不变 OneTime 刷新令牌時將更新令牌句柄

# RefreshTokenUsage_Label
source: Refresh Token Usage
fa: کاربرد رفرش توکن
zh_cn: 刷新令牌使用情况
zh_hant: 刷新令牌使用情况

# RequireClientSecret_Info
source: Specifies whether this client needs a secret to request tokens from the token endpoint (defaults to true)
fa: مشخص می کند که آیا این سرویس گیرنده نیاز به یک رمز برای درخواست کردن توکن ها از توکن نقطه پایان دارد (پیش فرض true)
zh_cn: 指定此客户端是否需要密钥才能从令牌端点请求令牌（默认为 true）
zh_hant: 指定此客戶端是否需要金鑰才能從令牌端點請求令牌（預設為 true）

# RequireClientSecret_Label
source: Require Client Secret
fa: نیازمند رمز سرویس گیرنده
zh_cn: 需要客户端密钥
zh_hant: 需要客戶端金鑰

# RequireConsent_Info
source: Specifies whether a consent screen is required. Defaults to true.
fa: مشخص می کند که آیا یک صفحه موافقت نیاز است. پیش فرض true
zh_cn: 指定是否需要同意屏幕。 默认为 true。
zh_hant: 指定是否需要同意螢幕。 預設為 true。

# RequireConsent_Label
source: Require Consent
fa: نیازمند موافقت
zh_cn: 需要同意
zh_hant: 需要同意

# RequirePkce_Info
source: Specifies whether clients using an authorization code based grant type must send a proof key
fa: مشخص می کند درحالی که سرویس گیرنده ها از یک کد مجوز بر پایه نوع واگذاری استفاده می کنند باید یک کلید اثبات ارسال کنند
zh_cn: 指定使用基于授权代码的授权类型的客户端是否必须发送校验密钥
zh_hant: 指定使用基於授權代碼的授權類型的客戶端是否必須發送校验金鑰

# RequirePkce_Label
source: Require Pkce
fa: نیازمند Pkce
zh_cn: 需要 Pkce
zh_hant: 需要 Pkce

# RoleNormalizedName_Info
source: The Normalized Role Name
fa: نام نقش نرمال شده
zh_cn: 规范化角色名称
zh_hant: 規範化角色名稱

# RoleNormalizedName_Label
source: Normalized Name
fa: نام نرمال شده
zh_cn: 规范化名称
zh_hant: 規範化名稱

# SecretType_Label
source: Secret Type
fa: نوع رمز
zh_cn: 密钥类型
zh_hant: 金鑰類型

# SecretValue_Label
source: Secret Value
fa: مقدار رمز
zh_cn: 密钥值
zh_hant: 金鑰值

# SlidingRefreshTokenLifetime_Info
source: Sliding lifetime of a refresh token in seconds. Defaults to 1296000 seconds / 15 days
fa: طول عمر اسلایدینگ یک رفرش توکن در ثانیه. پیش فرض 1296000 ثانیه / 15 روز
zh_cn: 滚动刷新生命周期是多少秒钟刷新令牌。 默认为 1296000 秒/15 天
zh_hant: 滾動刷新生命周期是多少秒鍾刷新令牌。 預設為 1296000 秒/15 天

# SlidingRefreshTokenLifetime_Label
source: Sliding Refresh Token Lifetime
fa: طول عمر اسلایدینگ رفرش توکن
zh_cn: 滚动刷新令牌生命周期
zh_hant: 滾動刷新令牌生命周期

# Type_Label
source: Claim Type
fa: نوع ادعا
zh_cn: 声明类型
zh_hant: 聲明類型

# UpdateAccessTokenClaimsOnRefresh_Info
source: Gets or sets a value indicating whether the access token (and its claims) should be updated on a refresh token request.
fa: می دهد یا تنظیم می کند یک مقدار که نشان می دهد توکن دسترسی (و ادعاهای آن) باید بوسیله درخواست یک رفرش توکن بروز شود.
zh_cn: 获取或设置一个值，该值指示是否应在刷新令牌请求上更新访问令牌（及其声明）。
zh_hant: 獲取或設置一个值，該值指示是否應在刷新令牌請求上更新訪問令牌 access_token（及其聲明）。

# UpdateAccessTokenClaimsOnRefresh_Label
source: Update Access Token Claims On Refresh
fa: ادعاهای توکن دسترسی با تازه سازی بروز شود
zh_cn: 刷新时更新访问令牌声明
zh_hant: 刷新時更新訪問令牌聲明

# UserCodeType_Info
source: Specifies the type of user code to use for the client. Otherwise falls back to default.
fa: نوع کد کاربر را برای استفاده برای سرویس گیرنده مشخص می کند. در غیر این صورت به پیش فرض می رود.
zh_hant: 指定用於客戶端的用戶代碼的類型。 否則回落到預設值。

# UserCodeType_Label
source: User Code Type
fa: نوع کد کاربر
zh_hant: 用戶代碼類型

# UserSsoLifetime_Info
source: The maximum duration (in seconds) since the last time the user authenticated. Defaults to null
fa: حداکثر مدت زمان (در ثانیه) از زمان آخرین تأیید هویت کاربر. پیش فرض null
zh_hant: 自上次用戶進行身份驗證以來的最長持續時間（以秒為單位）。 預設為 null

# UserSsoLifetime_Label
source: User Sso Lifetime
fa: طول عمر Sso کاربر
zh_hant: 用戶 SSO 生命周期

# Value_Label
source: Claim Value
fa: مقدار ادعا
zh_cn: 声明值
zh_hant: 聲明值
