Repository: skoruba/IdentityServer4.Admin
Catalog: src/Skoruba.IdentityServer4.STS.Identity/Resources/Controllers/ManageController.*.resx
Languages: ar, da, de, fa, fi, nl, ru

# AskForPersonalDataLog
source: User with ID '{0}' asked for their personal data.
ar: المستخدم ذو المعرف {0} يطلب معلوماته الشخصية
da: Bruger med ID '{0}' har bedt om at få deres personlige data.
de: Benutzer mit ID '{0}' fragt nach persönlichen Daten.
fa: کاربر با شناسه "{0}" اطلاعات شخصی شان را درخواست کرده است.
fi: Käyttäjä, jonka tunnus '{0}', pyysi henkilökohtaisia tietojaan.
nl: User met ID '{0}' vraagt om zijn persoonlijke data.
ru: Пользователь с ID '{0}' запросил свою личную информацию.

# AuthenticatorVerified
source: Your authenticator app has been verified.
ar: تطبيق المصادقة تم تأكيده.
da: Din bekræftelses app er blevet bekræftet.
de: Ihre Authentifizierungsapplikation wurde verifiziert.
fa: برنامه تأیید هویت شما تأیید شده است.
fi: Autentikaattorisovelluksesi on vahvistettu.
nl: Uw authenticator app is geverifieerd.
ru: Приложение аутентификатора проверено.

# ConfirmEmailBody
source: Please confirm your account by <a href='{0}'>clicking here</a>.
ar: الرجاء تأكيد حسابك <a href='{0}'>بالضغط هنا</a>
da: Bekræft venligst din email konto ved at <a href='{0}'>klikke her</a>.
de: Bitte bestätigen Sie Ihren Account indem Sie <a href='{0}'>hier klicken</a>.
fi: Vahvista tilisi napsauttamalla <a href='{0}'> napsauttamalla tätä </a>.
nl: Bevestig a.u.b. uw account door <a href='{0}'>hier te klikken</a>.
ru: Пожалуйста, подтвердите вашу учетную запись нажатием <a href='{0}'>на ссылку</a>.

# ConfirmEmailTitle
source: Confirm your email
ar: تأكيد البريد الالكتروني
da: Bekræft din email konto
de: Bestätigen Sie die Email
fi: vahvista sähköpostiosoitteesi
nl: Bevestig uw email
ru: Подтвердите ваш адрес электронной почты

# DeletePersonalData
source: User with ID '{0}' deleted themselves.
ar: المستخدمون ذو المعرف {0} حذفوا انفسهم
da: Bruger med ID '{0}' har slettet sin bruger.
de: Benutzer mit ID '{0}' hat sich selbst gelöscht.
fa: کاربر با شناسه '{0}' حذف شان کرده است.
fi: Käyttäjä, jonka tunnus '{0}', poisti itsensä.
nl: User met ID '{0}' heeft zichzelf verwijderd.
ru: Пользователь с ID '{0}' удалился.

# Error2FANotEnabled
source: Cannot generate recovery codes for user with ID {0} because they do not have 2FA enabled.
ar: لا يمكن توليد رموز استرجاع للمستخدم ذو المعرف {0} لانه لم يفعل خاصية المصادقة بخطوتين
da: Kan ikke generere gendannelseskoder til bruger med ID {0}, fordi de ikke har totrinsbekræftelse aktiveret.
de: Kann keine Wiederherstellungscodes für Benutzer mit ID {0} generieren, weil 2FA nicht aktiviert ist.
fa: نمی توان کدهای بازیابی را برای کاربر با شناسه {0} ایجاد کرد بدلیل اینکه 2FA را فعال نکرده اند.
fi: Palautuskoodeja ei voi luoda käyttäjälle, jonka tunnus on {0}, koska heillä ei ole 2FA: ta käytössä.
nl: Kan geen herstelcodes genereren for user met ID {0} omdat 2FA voor deze user niet geactiveerd is.
ru: Не удается создать коды восстановления для пользователя с ID {0} потому что у них активирована двухфакторная аутентификация.

# ErrorCode
source: Code
ar: رمز
da: Fejl kode
fa: کد
fi: Koodi
ru: Код

# ErrorDeletingUser
source: Unexpected error occurred deleting user with ID {0}.
ar: خطأ غير متوقع حدث للمستخدم ذو المعرف {0}.
da: Der opstod en uventet fejl ved sletning af bruger med ID {0}.
de: Unerwarteter Fehler beim Löschen von Benutzern mit ID {0} aufgetreten.
fa: خطای غیرمنتظره در حذف کاربر با شناسه {0} رخ داده است.
fi: Käyttäjän, jolla on tunnus {0}, poistamisessa tapahtui odottamaton virhe.
nl: Onverwachte fout opgetreden tijdens het verwijderen van user met ID {0}.
ru: Непредвиденная ошибка при удалении пользователя с ID {0}.

# ErrorDisable2FA
source: Unexpected error occurred disabling 2FA for user with ID {0}.
ar: خطأ غير متوقع حدث ادى الى ايقاف المصادقة بخطوتين للمستخدم ذو المعرف {0}.
da: Der opstod en uventet fejl, da der blev deaktiveret totrinsbekræftelse for bruger med ID {0}.
de: Unerwarteter Fehler beim abstellen von 2FA des Benutzers mit ID {0}.
fa: خطای غیرمنتظره در غیرفعال کردن 2FA برای کاربر با شناسه {0} رخ داده است.
fi: Odottamaton virhe tapahtui poistamalla 2FA käytöstä käyttäjälle, jolla on tunnus {0}.
nl: Onverwachte fout opgetreden tijdens deactiveren van 2FA voor user met ID {0}.
ru: Непредвиденная ошибка при отключении двухфакторной аутентификации для пользователя с ID {0}.

# ErrorGenerateCodesWithout2FA
source: Cannot generate recovery codes for user as they do not have 2FA enabled.
ar: لا يمكن توليد رموز استرجاع للمستخدم ذو المعرف {0} لانه لم يفعل خاصية المصادقة بخطوتين
da: Kan ikke generere gendannelseskoder for brugeren, da brugeren ikke har totrinsbekræftelse aktiveret.
de: Kann keine Wiederherstellungscodes für Benutzer generieren, da 2FA aktiviert ist.
fa: نمی توان کدهای بازیابی را برای کاربر ایجاد کرد بدلیل اینکه 2FA را فعال نکرده اند.
fi: Palautuskoodeja ei voi luoda käyttäjälle, koska heillä ei ole 2FA: ta käytössä.
nl: Kan geen herstelcodes genereren for user omdat 2FA voor deze user niet geactiveerd is.
ru: Не удается создать коды восстановления для пользователя потому что двухфакторная аутентификация отключена.

# ErrorLoadingExternalLogin
source: Unexpected error occurred loading external login info for user with ID {0}.
ar: خطأ غير متوقع حدث في عملية تحميل تسجيل الدخول الخارجي للمستخدم ذو المعرف {0}.
da: Der opstod en uventet fejl ved indlæsning af eksterne login informationer for bruger med ID {0}.
de: Unerwarteter Fehler beim Laden externer Anmeldeinformationen für Benutzer mit {0} aufgetreten.
fa: در بارگذاری اطلاعات ورود خارجی برای کاربر با شناسه {0} خطای غیرمنتظره رخ داده است.
fi: Odottamaton virhe ladattaessa ulkoista kirjautumistietoa käyttäjälle, jolla on tunnus {0}.
nl: Onverwachte fout opgetreden tijdens het laden van externe login info voor user met ID {0}.
ru: Непредвиденная ошибка при загрузке внешних данных для входа пользователя с ID {0}.

# ErrorRemovingExternalLogin
source: Unexpected error occurred removing external login for user with ID {0}.
ar: خطأ غير متوقع حدث في عملية حذف تسجيل الدخول الخارجي للمستخدم ذو المعرف {0}.
da: Der opstod en uventet fejl ved fjernelse af eksternt login til bruger med ID {0}.
de: Unerwarteter Fehler beim entfernen des externen Logins von Benutzer mit ID {0}.
fa: در حذف ورود خارجی برای کاربر با شناسه {0} خطای غیرمنتظره رخ داده است.
fi: Odottamaton virhe ulkoisen kirjautumisen poistamisessa käyttäjälle, jolla on tunnus {0}.
nl: Onverwachte fout opgetreden tijdens het verwijderen van externe login voor user met ID {0}.
ru: Непредвиденная ошибка при удалении внешнего входа для пользователя с ID {0}.

# ErrorSettingEmail
source: Unexpected error occurred setting email for user with ID {0}.
ar: خطأ غير متوقع حدث في عملية ضبط البريد الالكتروني للمستخدم ذو المعرف {0}.
da: Der opstod en uventet fejl ved indstilling af email til bruger med ID {0}.
de: Unerwarteter Fehler beim Setzen der Email des Benutzers mit ID {0}.
fa: خطای غیرمنتظره در تنظیم ایمیل برای کاربر با شناسه {0} رخ داده است.
fi: Asettamalla odottamaton virhe sähköpostin asettamisessa käyttäjälle, jolla on tunnus {0}.
nl: Onverwachte fout opgetreden tijdens het instellen van het emailadres voor user met ID {0}.
ru: Произошла непредвиденная ошибка при настройке электронной почты для пользователя с ID {0}.

# ErrorSettingPhone
source: Unexpected error occurred setting phone number for user with ID {0}.
ar: خطأ غير متوقع حدث في عملية ضبط رقم الهاتف للمستخدم ذو المعرف {0}.
da: Der opstod en uventet fejl ved indstilling af telefonnummer for bruger med ID {0}.
de: Unerwarteter Fehler beim Setzen der Email der Telefonnummer mit ID {0}.
fa: خطای غیرمنتظره در تنظیم شماره تلفن برای کاربر با شناسه {0} رخ داده است.
fi: Asettamalla odottamaton virhe puhelinnumeron asettamisessa käyttäjälle, jolla on tunnus {0}.
nl: Onverwachte fout opgetreden tijdens het instellen van het telefoonnummer voor user met ID {0}.
ru: Произошла непредвиденная ошибка при установке номера телефона для пользователя с ID {0}.

# ExternalLoginAdded
source: The external login was added.
ar: تسجيل الدخول الخارجي تمت اضافته بنجاح
da: Det eksterne login blev tilføjet.
de: Der externe Login wurde hinzugefügt.
fa: ورود خارجی اضافه شد.
fi: Ulkoinen kirjautuminen lisättiin.
nl: De externe login is toegevoegd
ru: Внешний вход был добавлен.

# ExternalLoginRemoved
source: The external login was removed.
ar: تسجيل الدخول الخارجي تم حذفه بنجاح
da: Det eksterne login blev fjernet.
de: Der externe Login wurde entfernt.
fa: ورود خارجی حذف شد.
fi: Ulkoinen sisäänkirjautuminen poistettiin.
nl: De externe login is verwijderd
ru: Внешний вход был удалён.

# InvalidVerificationCode
source: Verification code is invalid.
ar: رمز التأكيد غير صحيح
da: Bekræftelseskoden er ugyldig.
de: Verifizierungscode ist ungültig.
fa: کد تأیید نامعتبر است.
fi: Vahvistuskoodi on virheellinen.
nl: Verificatiecode is ongeldig.
ru: Неверный проверочный код.

# PasswordChanged
source: Your password has been changed.
ar: تم تغيير كلمة المرور الخاصة بك.
da: Din adgangskode er blevet ændret.
de: Ihr Passwort wurde geändert.
fa: کلمه عبور شما تغییر کرده است.
fi: Salasanasi on vaihdettu.
nl: Uw wachtwoord is gewijzigd
ru: Ваш пароль был изменён.

# PasswordChangedLog
source: User {0} changed their password successfully.
ar: المستخدمون {0} غيروا كلمات المرور الخاصة بهم بنجاح
da: Bruger {0} ændrede deres adgangskode succesfuldt.
de: Benutzer {0} hat sein Passwort erfolgreich geändert.
fa: کاربر {0} کلمه عبور خود را با موفقیت تغییر داد.
fi: Käyttäjä {0} vaihtoi salasanansa onnistuneesti.
nl: User {0} heeft zijn wachtwoord succesvol gewijzigd
ru: Пользователь {0} успешно сменил пароль.

source: Password not correct.
ar: كلمة المرور غير صحيحة
da: Adgangskode er ikke korrekt.
de: Passwort nicht korrekt.
fa: کلمه عبور صحیح نیست.
fi: Salasana ei ole oikea.
nl: Wachtwoord onjuist
ru: Пароль неверный.

# PasswordSet
source: Your password has been set.
ar: تم ضبط كلمة المرور الخاصة بك
da: Din adgangskode er gemt.
de: Ihr Passwort wurde gesetzt.
fa: کلمه عبور شما تنظیم شده است.
fi: Salasanasi on asetettu.
nl: Uw wachtwoord is ingesteld
ru: Ваш пароль установлен.

# ProfileUpdated
source: Your profile has been updated
ar: تم تحديث ملفك التعريفي
da: Din profil er blevet opdateret
de: Ihr Profil wurde geupdatet
fa: مشخصات شما به روز شده است
fi: Profiilisi on päivitetty
nl: Uw profiel is geupdate
ru: Ваш профиль был обновлён.

# SuccessDisabled2FA
source: User with ID {0} has disabled 2fa.
ar: المستخدم ذو المعرف {0} اوقف عملية المصادقة بخطوتين
da: Bruger med ID {0} har deaktiveret totrinsbekræftelse.
de: Benutzer mit ID {0} hat 2FA abgeschaltet.
fa: کاربر با شناسه {0} 2fa را غیر فعال کرده است.
fi: Käyttäjätunnuksella {0} on poistettu 2fa käytöstä.
nl: User met ID {0} heeft 2FA gedeactiveerd.
ru: Пользователь с ID {0} отключил двухфакторную аутентификацию.

# SuccessForgetBrowser2FA
source: The current browser has been forgotten. When you login again from this browser you will be prompted for your 2fa code.
ar: المتصفح الحالي تم نسيانه. عندما تسجل الدخول في المرة القادمة سيتم مطالبتك برمز المصادقة بخطوتين.
da: Den aktuelle browser er glemt. Når du logger ind igen fra denne browser, bliver du bedt om din bekræftelseskode.
de: Der aktuelle Browser wurde vergessen. Wenn Sie sich von diesem Browser aus wieder einloggen, werden Sie nach Ihrem 2FA-Code gefragt.
fa: مرورگر فعلی فراموش شده است. هنگامی که دوباره از این مرورگر وارد سیستم شوید، از شما کد 2fa خواسته خواهد شد.
fi: Nykyinen selain on unohdettu. Kun kirjaudut sisään uudelleen tästä selaimesta, sinulta kysytään 2fa-koodiasi.
nl: De huidige browser wordt vergeten. Wanneer u opnieuw inlogd met de huidige browser wordt u gevraagd om uw 2FA code.
ru: Текущий браузер был забыт. При повторном входе в систему из этого браузера вам будет предложено ввести код двухфакторной аутентификации.

# SuccessResetAuthenticationKey
source: User with id {0} has reset their authentication app key.
ar: المستخدم ذو المعرف {0} اعاد ضبط تطبيق المصادقة بخطوتين الخاص به.
da: Bruger med id {0} har nulstillet deres bekræftelsesnøgle.
de: Benutzer mit ID {0} hat ihren Authentifizierungs-App Key zurückgesetzt.
fa: کاربر با شناسه {0} کلید برنامه تأیید اعتبار خود را تنظیم مجدد کرده است.
fi: Käyttäjä, jonka tunnus on {0}, on nollannut todennussovelluksen avaimen.
nl: User met id {0} heeft zijn authentication app key gereset.
ru: Пользователь с ID {0} сбросил ключ приложения аутентификации.

# SuccessUserEnabled2FA
source: User with ID {0} has enabled 2FA with an authenticator app.
ar: المستخدم ذو المعرف {0} فعل خاصية المصادقة بخطوتين باستخدام تطبيق المصادقة.
da: Bruger med ID {0} har aktiveret totrinsbekræftelse med en totrinsbekræftelses app.
de: Benutzer mit ID {0} hat 2FA mit einer Authentifizierungs-App aktiviert.
fa: کاربر با شناسه {0} 2FA را با یک برنامه تأیید هویت فعال کرده است.
fi: Käyttäjä, jonka tunnus on {0}, on ottanut käyttöön 2FA: n todennussovelluksella.
nl: User met id {0} heeft 2FA geactiveerd met een authenticator app.
ru: Пользоваетль с ID {0} влкючил двухфакторную аутентификацию с приложением проверки подлинности.

# UserGenerated2FACodes
source: User with ID {0} has generated new 2FA recovery codes.
ar: المستخدم ذو المعرف {0} انشأ رموز استرجاع جديدة للمصادقة بخطوتين.
da: Bruger med ID {0} har genereret nye totrinsbekræftelse gendannelseskoder.
de: Benutzer mit ID {0} hat neue 2FA Wiederherstellungscodes generiert.
fa: کاربر با شناسه {0} کد جدید بازیابی 2FA را ایجاد کرده است.
fi: Käyttäjä, jonka tunnus on {0}, on luonut uusia 2FA-palautuskoodeja.
nl: User met ID {0} nieuwe 2FA herstelcodes gegenereerd.
ru: Пользователь с ID {0} сгенерировал новые коды восстановления с двухфакторной аутентификацией.

# UserNotFound
source: Unable to load user with ID {0}.
ar: لا يمكن تحميل المستخدم ذو المعرف {0}.
da: Kan ikke indlæse bruger med ID {0}.
de: Kann Benutzer mit ID {0} nicht laden.
fa: بارگذاری کاربر با شناسه {0} امکان پذیر نیست.
fi: Käyttäjää, jolla on tunnus {0}, ei voi ladata.
nl: User met ID {0} kan niet worden geladen.
ru: Невозможно загрузить данные пользователя с ID {0}.

# VerificationSent
source: Verification email sent. Please check your email.
ar: تم ارسال رسالة تأكيد . الرجاء قحص بريدك الالكتروني
da: Bekræftelses email er sendt. Tjek venligst din email.
de: Verifizierungs-E-Mail gesendet. Bitte überprüfen Sie Ihre E-Mail.
fa: ایمیل تأیید ارسال شد. لطفا ایمیل خود را چک کنید.
fi: Varmennusviesti lähetetty. Ole hyvä ja tarkista sähköpostisi.
nl: Bevestigings email verzonden. Controleer a.u.b. uw email.
ru: Подтверждение по электронной почте отправлено. Пожалуйста,проверьте электронную почту.
